# 2025/2/2-17:00
# 检测报告类型与编号对应规则
report_type_number = {
    "sex_hormone": 1,
    "amh": 2,
    "sperm_status": 3,
    "bUltrasound_Chinese": 4,
    "bUltrasound_Thailand": 5,
    "immuno_five": 6, 
    "coag_function": 7,  
    "renal_function": 8, 
    "blood_type": 9, 
    "blood_routine": 10,  
    "ct_dna": 11, 
    "infectious_disease": 12,  
    "torch": 13,  
    "mycoplasma": 14,  
    "hcg_pregnancy": 15,  
    "thalassemia": 16,  
    "anemia_four": 17,  
    "liver_function": 18,  
    "thyroid_function": 19, 
    "preconception_health": 20,  
    "urine_routine": 21,  
    "nuclear_medicine": 22,  
    "tb_tcell": 23,  
    "rf_typing": 24,  
    "blood_lipid": 25,  
    "blood_glucose": 26,  
    "homocysteine": 27,  
    "tct": 28,  
    "y_microdeletion": 29,  
    "lupus": 30,  
    "leukorrhea_routine": 31, 
    "tumor_marker": 32, 
    "neisseria_gonorrhoeae_culture": 33,
    "membrane_potential": 34,
    "dna_fragmentation_index": 35,
}
report_type_chinese = {
    "sex_hormone": "性激素六项",
    "amh": "amh",
    "sperm_status": "精子报告",
    "bUltrasound_Chinese": "中文B超",
    "bUltrasound_Thailand": "泰国B超",
    "immuno_five": "免疫五项",
    "coag_function": "凝血功能四项",
    "renal_function": "肾功",
    "blood_type": "血型",
    "blood_routine": "血常规",
    "ct_dna": "衣原体",
    "infectious_disease": "传染病四项",
    "torch": "优生五项TORCH",
    "mycoplasma": "支原体",
    "hcg_pregnancy": "hcg妊娠诊断报告",
    "thalassemia": "地中海贫血症",
    "anemia_four": "贫血四项",
    "liver_function": "肝功五项",
    "thyroid_function": "甲功",
    "preconception_health": "孕前基础健康评估报告",
    "urine_routine": "尿常规",
    "nuclear_medicine": "核医学",
    "tb_tcell": "结核感染t细胞检测",
    "rf_typing": "rf分型(类风湿因子)",
    "blood_lipid": "血脂",
    "blood_glucose": "血糖",
    "homocysteine": "同型半胱氨酸报告",
    "tct": "tct",
    "y_microdeletion": "Y - 染色体微缺失",
    "lupus": "狼疮",
    "leukorrhea_routine": "白带常规",
    "tumor_marker": "肿瘤标记物",
    "neisseria_gonorrhoeae_culture": "淋球菌",
    "membrane_potential": "精子线粒体膜电位",
    "dna_fragmentation_index": "DNA碎片化指数",
}


# =============================================
# 检测项目：性激素六项 (sex_hormone)
# 检测编号：1
# 指标数量：6
# =============================================
sex_hormone_LH = {
    "name": "黄体生成素(LH)",
    "unit": "mIU/mL",
    "stage": ["男性","女性卵泡期","女性排卵期","女性黄体期","女性绝经期"],
    "size_range": [
        [(0,1.1),(1.1,5.9),(5.9,20.2),(20.2,25.0),(25.0,1000000)],    #男性
        [(0,1.2),(1.2,3.5),(3.5,10.2),(10.2,12.5),(12.5,1000000)],    #女性卵泡期
        [(0,12),(12,26.0),(26.0,68.0),(68.0,82),(82,1000000)],        #女性排卵期
        [(0,0.4),(0.4,4.1),(4.1,15.3),(15.3,19.0),(19.0,1000000)],    #女性黄体期
        [(0,14),(14,20.8),(20.8,41.2),(41.2,48),(48,1000000)]         #女性绝经期
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"]
    ],
    "analysis":[
        ["提示严重生精功能障碍或输精管阻塞", "可能为检测时段生理性波动", "促性腺功能正常,支持睾酮合成", "可能提示生精功能轻度受损的代偿性升高", "提示生精功能障碍或睾丸衰竭"],
        ["可能提示垂体功能减退或下丘脑异常。", "可能处于黄体期或提示暂时性激素抑制。", "说明促性腺功能正常,有助于排卵。", "可能提示卵巢储备下降或排卵期。", "存在多囊卵巢综合征或肾上腺功能亢奋,也有可能是卵巢功能早衰。"],
        ["可能提示垂体功能减退或下丘脑异常。", "可能处于黄体期或提示暂时性激素抑制。", "说明促性腺功能正常,有助于排卵。", "可能提示卵巢储备下降或排卵期。", "存在多囊卵巢综合征或肾上腺功能亢奋,也有可能是卵巢功能早衰。"],
        ["可能提示垂体功能减退或下丘脑异常。", "可能处于黄体期或提示暂时性激素抑制。", "说明促性腺功能正常,有助于排卵。", "可能提示卵巢储备下降或排卵期。", "存在多囊卵巢综合征或肾上腺功能亢奋,也有可能是卵巢功能早衰。"],
        ["可能提示垂体功能减退或下丘脑异常。", "可能处于黄体期或提示暂时性激素抑制。", "说明促性腺功能正常,有助于排卵。", "可能提示卵巢储备下降或排卵期。", "存在多囊卵巢综合征或肾上腺功能亢奋,也有可能是卵巢功能早衰。"]
    ]
}
sex_hormone_FSH = { 
    "name": "卵泡刺激素(FSH)",
    "unit": "mIU/mL",
    "stage": ["男性","女性卵泡期","女性排卵期","女性黄体期","女性绝经期"],
    "size_range": [
        [(0,1.5),(1.5,3.6),(3.6,9.7),(9.7,11.8),(11.8,1000000)],     #男性
        [(0,3.2),(3.2,5.6),(5.6,12.6),(12.6,15),(15,1000000)],       #女性卵泡期
        [(0,7.5),(7.5,10.0),(10.0,17.5),(17.5,20),(20,1000000)],     #女性排卵期
        [(0,1.3),(1.3,3.2),(3.2,9.1),(9.1,11),(11,1000000)],         #女性黄体期
        [(0,36),(36,56.4),(56.4,117.6),(117.6,138),(138,1000000)]    #女性绝经期
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"]
    ],
    "analysis":[
        ["可能为先天性间质细胞发育不良", "可能与近期感染或应激状态有关", "睾丸支持细胞功能良好,精子生成正常", "间质细胞功能暂时性亢进的表现", "可能提示间质细胞瘤或肾上腺皮质增生"],
        ["可能提示垂体功能障碍或卵巢储备不足。", "可能为黄体期或激素调节影响所致。", "说明卵巢良好,卵泡发育正常。", "可能提示卵巢功能开始下降或进入排卵前期。", "垂体瘤会导致过度分泌FSH,如果垂体正常则可能存在卵巢功能减退或多囊卵巢综合征(PCOS)。"],
        ["可能提示垂体功能障碍或卵巢储备不足。", "可能为黄体期或激素调节影响所致。", "说明卵巢良好,卵泡发育正常。", "可能提示卵巢功能开始下降或进入排卵前期。", "垂体瘤会导致过度分泌FSH,如果垂体正常则可能存在卵巢功能减退或多囊卵巢综合征(PCOS)。"],
        ["可能提示垂体功能障碍或卵巢储备不足。", "可能为黄体期或激素调节影响所致。", "说明卵巢良好,卵泡发育正常。", "可能提示卵巢功能开始下降或进入排卵前期。", "垂体瘤会导致过度分泌FSH,如果垂体正常则可能存在卵巢功能减退或多囊卵巢综合征(PCOS)。"],
        ["可能提示垂体功能障碍或卵巢储备不足。", "可能为黄体期或激素调节影响所致。", "说明卵巢良好,卵泡发育正常。", "可能提示卵巢功能开始下降或进入排卵前期。", "垂体瘤会导致过度分泌FSH,如果垂体正常则可能存在卵巢功能减退或多囊卵巢综合征(PCOS)。"]
    ]
}
#性激素六项各种指标取值范围 男性 卵泡,排卵,黄体,绝经 || 孕期1,孕期2,孕期3 (后三个仅限孕酮(P4))
sex_hormone_P4 = { 
    "name": "孕酮(P4)",
    "unit": "ng/mL",
    "stage": ["男性","女性卵泡期","女性排卵期","女性黄体期","女性绝经期","孕期1","孕期2","孕期3"],
    "size_range": [
        [(0,0.23),(0.23,0.57),(0.57,1.16),(1.16,1.50),(1.50,1000000)],            #男性
        [(0,0.36),(0.36,0.55),(0.55,1.02),(1.02,1.21),(1.02,1000000)],            #女性卵泡期
        [(0,0.39),(0.39,5.41),(5.41,17.85),(17.85,22.87),(22.87,1000000)],        #女性排卵期
        [(0,2.12),(2.12,7.85),(7.85,20.71),(20.71,26.44),(26.44,1000000)],        #女性黄体期
        [(0,0),(0,0.18),(0.18,0.71),(0.71,0.89),(0.89,1000000)],                  #女性绝经期
        [(0,1.17),(1.17,12.28),(12.28,38.79),(38.79,49.9),(49.9,1000000)],        #孕期1
        [(0,15.4),(15.4,26.5),(26.5,57.8),(57.8,68.9),(68.9,1000000)],            #孕期2
        [(0,59.8),(59.8,65.9),(65.9,73.9),(73.9,80),(80,1000000)]                 #孕期3
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"]
    ],
    "analysis":[
        ["需排除垂体前叶功能减退症", "可能反映轻度内分泌调节异常", "间质细胞功能正常,雄激素分泌稳定", "可能与应激性激素波动有关", "需排除垂体肿瘤或下丘脑功能紊乱"],
        ["可能提示无排卵或黄体功能不足。", "可能提示排卵后黄体功能不全的早期表现。", "说明黄体功能良好,有助于维持妊娠或黄体期健康。", "可能处于黄体期或提示短暂内分泌波动。", "可能提示黄体囊肿或肾上腺功能异常。"],
        ["可能提示无排卵或黄体功能不足。", "可能提示排卵后黄体功能不全的早期表现。", "说明黄体功能良好,有助于维持妊娠或黄体期健康。", "可能处于黄体期或提示短暂内分泌波动。", "可能提示黄体囊肿或肾上腺功能异常。"],
        ["可能提示无排卵或黄体功能不足。", "可能提示排卵后黄体功能不全的早期表现。", "说明黄体功能良好,有助于维持妊娠或黄体期健康。", "可能处于黄体期或提示短暂内分泌波动。", "可能提示黄体囊肿或肾上腺功能异常。"],
        ["可能提示无排卵或黄体功能不足。", "可能提示排卵后黄体功能不全的早期表现。", "说明黄体功能良好,有助于维持妊娠或黄体期健康。", "可能处于黄体期或提示短暂内分泌波动。", "可能提示黄体囊肿或肾上腺功能异常。"],
        ["可能提示无排卵或黄体功能不足。", "可能提示排卵后黄体功能不全的早期表现。", "说明黄体功能良好,有助于维持妊娠或黄体期健康。", "可能处于黄体期或提示短暂内分泌波动。", "可能提示黄体囊肿或肾上腺功能异常。"],
        ["可能提示无排卵或黄体功能不足。", "可能提示排卵后黄体功能不全的早期表现。", "说明黄体功能良好,有助于维持妊娠或黄体期健康。", "可能处于黄体期或提示短暂内分泌波动。", "可能提示黄体囊肿或肾上腺功能异常。"],
        ["可能提示无排卵或黄体功能不足。", "可能提示排卵后黄体功能不全的早期表现。", "说明黄体功能良好,有助于维持妊娠或黄体期健康。", "可能处于黄体期或提示短暂内分泌波动。", "可能提示黄体囊肿或肾上腺功能异常。"]
    ]
}
sex_hormone_Testosterone = { 
    "name": "睾酮(Testosterone)",
    "unit": "ng/mL",
    "stage": ["男性","女性卵泡期","女性排卵期","女性黄体期","女性绝经期"],
    "size_range": [ 
        [(0,2.8),(2.8,4.0),(4.0,7.6),(7.6,8.8),(8.8,1000000)],          #男性
        [(0,0.15),(0.15,0.26),(0.26,0.59),(0.59,0.7),(0.7,1000000)],    #女性卵泡期
        [(0,0.15),(0.15,0.26),(0.26,0.59),(0.59,0.7),(0.7,1000000)],    #女性排卵期
        [(0,0.15),(0.15,0.26),(0.26,0.59),(0.59,0.7),(0.7,1000000)],    #女性黄体期
        [(0,0.15),(0.15,0.26),(0.26,0.59),(0.59,0.7),(0.7,1000000)]     #女性绝经期
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"]
    ],
    "analysis":[
        ["可能提示性腺功能减退或内分泌疾病。", "可能与疲劳、压力或内分泌波动有关。", "说明性腺分泌正常,性功能维持良好。", "可能与压力、运动或暂时性激素波动有关。", "可能提示睾丸或肾上腺病变、外源性激素摄入等因素。"],
        ["可能提示性腺功能减退或内分泌疾病。", "可能与疲劳、压力或内分泌波动有关。", "说明性腺分泌正常,性功能维持良好。", "可能与压力、运动或暂时性激素波动有关。", "可能提示多囊卵巢、雄激素过多或肿瘤因素。"],
        ["可能提示性腺功能减退或内分泌疾病。", "可能与疲劳、压力或内分泌波动有关。", "说明性腺分泌正常,性功能维持良好。", "可能与压力、运动或暂时性激素波动有关。", "可能提示多囊卵巢、雄激素过多或肿瘤因素。"],
        ["可能提示性腺功能减退或内分泌疾病。", "可能与疲劳、压力或内分泌波动有关。", "说明性腺分泌正常,性功能维持良好。", "可能与压力、运动或暂时性激素波动有关。", "可能提示多囊卵巢、雄激素过多或肿瘤因素。"],
        ["可能提示性腺功能减退或内分泌疾病。", "可能与疲劳、压力或内分泌波动有关。", "说明性腺分泌正常,性功能维持良好。", "可能与压力、运动或暂时性激素波动有关。", "可能提示多囊卵巢、雄激素过多或肿瘤因素。"]
    ]
}
sex_hormone_E2 = { 
    "name": "雌二醇(E2)",
    "unit": "pg/mL",
    "stage": ["男性","女性卵泡期","女性排卵期","女性黄体期","女性绝经期"],
    "size_range": [
        [(0,0),(0,0),(0,87),(87,87),(87,1000000)],                                #男性
        [(0,15),(15,40.4),(40.4,86.6),(86.6,112),(112,1000000)],                  #女性卵泡期
        [(0,136),(136,161.0),(161.0,226.0),(226.0,251),(251,1000000)],            #女性排卵期
        [(0,48),(48,77.6),(77.6,142.4),(142.4,172),(172,1000000)],                #女性黄体期
        [(0,10),(10,23.2),(23.2,52.8),(52.8,66),(66,1000000)]                     #女性绝经期
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"]
    ],
    "analysis":[
        ["可能提示芳香化酶活性异常升高", "可能为检测前剧烈运动影响", "雌激素代谢平衡,维持生理功能", "可能反映轻度肝功能代谢异常", "可能提示睾丸支持细胞功能异常"],
        ["可能提示卵巢功能减退或雌激素缺乏。", "可能处于月经早期或内分泌调节阶段。", "说明卵巢功能良好,月经周期和女性特征正常。", "可能处于排卵期或受体内激素波动影响。", "可能提示卵巢囊肿、雌激素分泌异常或激素治疗影响。"],
        ["可能提示卵巢功能减退或雌激素缺乏。", "可能处于月经早期或内分泌调节阶段。", "说明卵巢功能良好,月经周期和女性特征正常。", "可能处于排卵期或受体内激素波动影响。", "可能提示卵巢囊肿、雌激素分泌异常或激素治疗影响。"],
        ["可能提示卵巢功能减退或雌激素缺乏。", "可能处于月经早期或内分泌调节阶段。", "说明卵巢功能良好,月经周期和女性特征正常。", "可能处于排卵期或受体内激素波动影响。", "可能提示卵巢囊肿、雌激素分泌异常或激素治疗影响。"],
        ["可能提示卵巢功能减退或雌激素缺乏。", "可能处于月经早期或内分泌调节阶段。", "说明卵巢功能良好,月经周期和女性特征正常。", "可能处于排卵期或受体内激素波动影响。", "可能提示卵巢囊肿、雌激素分泌异常或激素治疗影响。"]
    ]
}
sex_hormone_PRL = { 
    "name": "催乳素(PRL)",
    "unit": "ng/mL",
    "stage": ["男性","女性卵泡期","女性排卵期","女性黄体期","女性绝经期"],
    "size_range": [
        [(0,2.54),(2.54,5.75),(5.75,12.77),(12.77,15.98),(15.98,1000000)],       #男性
        [(0,3.10),(3.10,7.68),(7.68,18.45),(18.45,23.03),(23.03,1000000)],       #女性卵泡期
        [(0,3.10),(3.10,7.68),(7.68,18.45),(18.45,23.03),(23.03,1000000)],       #女性排卵期
        [(0,3.10),(3.10,7.68),(7.68,18.45),(18.45,23.03),(23.03,1000000)],       #女性黄体期
        [(0,2.91),(2.91,6.94),(6.94,15.24),(15.24,19.27),(19.27,1000000)]        #女性绝经期
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"]
    ],
    "analysis":[
        ["需排除全垂体功能减退可能", "需排除药物抑制作用", "泌乳素水平正常,无异常分泌刺激", "可能与睡眠障碍或精神压力相关", "需排除垂体泌乳素瘤或药物影响"],
        ["可能与垂体功能异常或激素分泌不足有关。", "一般临床意义不大,可与激素水平波动有关。", "说明脑下垂体功能正常,不会影响排卵或乳腺功能。", "可能与情绪、压力或睡眠不足有关。", "可能提示泌乳素瘤或下丘脑垂体轴异常。"],
        ["可能与垂体功能异常或激素分泌不足有关。", "一般临床意义不大,可与激素水平波动有关。", "说明脑下垂体功能正常,不会影响排卵或乳腺功能。", "可能与情绪、压力或睡眠不足有关。", "可能提示泌乳素瘤或下丘脑垂体轴异常。"],
        ["可能与垂体功能异常或激素分泌不足有关。", "一般临床意义不大,可与激素水平波动有关。", "说明脑下垂体功能正常,不会影响排卵或乳腺功能。", "可能与情绪、压力或睡眠不足有关。", "可能提示泌乳素瘤或下丘脑垂体轴异常。"],
        ["可能与垂体功能异常或激素分泌不足有关。", "一般临床意义不大,可与激素水平波动有关。", "说明脑下垂体功能正常,不会影响排卵或乳腺功能。", "可能与情绪、压力或睡眠不足有关。", "可能提示泌乳素瘤或下丘脑垂体轴异常。"],
    ]
}
# 性激素六项 gather列表
sex_hormone_gather = [
    sex_hormone_LH,
    sex_hormone_FSH,
    sex_hormone_P4,
    sex_hormone_Testosterone,
    sex_hormone_E2,
    sex_hormone_PRL
]

# =============================================
# 检测项目：AMH判定规则库 (AMH)
# 检测编号：2
# 指标数量：1
# =============================================
amh_AMH = { 
    "name": "抗缪勒氏管激素(AMH)",
    "unit": "ng/mL",
    "stage": ["男性","女性20-24岁","女性25-29岁","女性30-34岁","女性35-39岁","女性40-44岁","女性45-50岁"],
    "size_range": [
        [(0,0.834),(0.834,7.042),(7.042,13.25),(13.25,13.25),(13.25,1000000)],    #男性
        [(0,1.135),(1.135,6.3),(6.3,11.460),(11.460,11.460),(11.460,1000000)],    #女性20-24岁
        [(0,0.775),(0.775,5.26),(5.26,9.752),(9.752,9.752),(9.752,1000000)],      #女性25-29岁
        [(0,0.334),(0.334,4.1),(4.1,7.834),(7.834,7.834),(7.834,1000000)],        #女性30-34岁
        [(0,0.133),(0.133,3.4),(3.4,6.653),(6.653,6.653),(6.653,1000000)],        #女性35-39岁
        [(0,0.027),(0.027,2.9),(2.9,5.667),(5.667,5.667),(5.667,1000000)],        #女性40-44岁
        [(0,0.020),(0.020,1.41),(1.41,2.824),(2.824,2.824),(2.824,1000000)]       #女性45-50岁
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"],
        ["过低","偏低","正常","偏高","过高"]
    ],
    "analysis":[
        [
            "可能提示卵巢功能减退或面临卵巢早衰风险。",
            "您的数值比较低,说明卵巢储备功能已经非常不足了,卵子库存告急,而且卵巢功能不可逆,会越来越低,建议咨询生殖医生,尽快开始试管。",
            "您的数值复合年龄,现在是生育的黄金年龄,卵巢功能不可逆,年龄越大储备越差,一定要尽快开始试管。",
            "可能提示多囊卵巢倾向或卵巢反应性增强。",
            "可能与多囊卵巢综合征有关,需结合其他指标进一步判断。"
        ],
        [
            "可能提示卵巢功能减退或面临卵巢早衰风险。",
            "您的数值比较低,说明卵巢储备功能已经非常不足了,卵子库存告急,而且卵巢功能不可逆,会越来越低,建议咨询生殖医生,尽快开始试管。",
            "您的数值复合年龄,现在是生育的黄金年龄,卵巢功能不可逆,年龄越大储备越差,一定要尽快开始试管。",
            "可能提示多囊卵巢倾向或卵巢反应性增强。",
            "可能与多囊卵巢综合征有关,需结合其他指标进一步判断。"
        ],
        [
            "可能提示卵巢功能减退或面临卵巢早衰风险。",
            "您的数值比较低,说明卵巢储备功能已经非常不足了,卵子库存告急,而且卵巢功能不可逆,会越来越低,建议咨询生殖医生,尽快开始试管。",
            "您的数值复合年龄,现在是生育的黄金年龄,卵巢功能不可逆,年龄越大储备越差,一定要尽快开始试管。",
            "可能提示多囊卵巢倾向或卵巢反应性增强。",
            "可能与多囊卵巢综合征有关,需结合其他指标进一步判断。"
        ],
        [
            "可能提示卵巢功能减退或面临卵巢早衰风险。",
            "您的数值比较低,说明卵巢储备功能已经非常不足了,卵子库存告急,而且卵巢功能不可逆,会越来越低,建议咨询生殖医生,尽快开始试管。",
            "您的数值复合年龄,现在是生育的黄金年龄,卵巢功能不可逆,年龄越大储备越差,一定要尽快开始试管。",
            "可能提示多囊卵巢倾向或卵巢反应性增强。",
            "可能与多囊卵巢综合征有关,需结合其他指标进一步判断。"
        ],
        [
            "可能提示卵巢功能减退或面临卵巢早衰风险。",
            "您的数值比较低,说明卵巢储备功能已经非常不足了,卵子库存告急,而且卵巢功能不可逆,会越来越低,建议咨询生殖医生,尽快开始试管。",
            "您的数值复合年龄,现在是生育的黄金年龄,卵巢功能不可逆,年龄越大储备越差,一定要尽快开始试管。",
            "可能提示多囊卵巢倾向或卵巢反应性增强。",
            "可能与多囊卵巢综合征有关,需结合其他指标进一步判断。"
        ],
        [
            "可能提示卵巢功能减退或面临卵巢早衰风险。",
            "您的数值比较低,说明卵巢储备功能已经非常不足了,卵子库存告急,而且卵巢功能不可逆,会越来越低,建议咨询生殖医生,尽快开始试管。",
            "您的数值复合年龄,现在是生育的黄金年龄,卵巢功能不可逆,年龄越大储备越差,一定要尽快开始试管。",
            "可能提示多囊卵巢倾向或卵巢反应性增强。",
            "可能与多囊卵巢综合征有关,需结合其他指标进一步判断。"
        ],
        [
            "可能提示卵巢功能减退或面临卵巢早衰风险。",
            "您的数值比较低,说明卵巢储备功能已经非常不足了,卵子库存告急,而且卵巢功能不可逆,会越来越低,建议咨询生殖医生,尽快开始试管。",
            "您的数值复合年龄,现在是生育的黄金年龄,卵巢功能不可逆,年龄越大储备越差,一定要尽快开始试管。",
            "可能提示多囊卵巢倾向或卵巢反应性增强。",
            "可能与多囊卵巢综合征有关,需结合其他指标进一步判断。"
        ]
    ]
}

# AMH gather列表
amh_gather = [
    amh_AMH
]


# =============================================
# 检测项目：精子 (sperm_status)
# 检测编号：3
# 指标数量：12
# =============================================
sperm_status_semenVolume = {
    "name": "精液量(Volume)",
    "unit": "ml",
    "stage": ["通用",],
    "size_range": [
        [(0,1.5),(1.5,1.5),(1.5,1000000),(1000000,1000000),(1000000,1000000)],  #精液量
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
    ],
    "analysis": [[
        "可能提示精囊功能减退或堵塞", 
        "可能与频繁排精或轻度精囊功能减退有关。", 
        "说明附睾、精囊功能正常,精液分泌正常。", 
        "可能与饮水较多或间隔时间较长有关。", 
        "可能提示精囊功能亢进或炎症"
    ],]
}
sperm_status_liquefactionTime = {
    "name": "液化时间(Liquefaction)",
    "unit": "Min",
    "stage": ["通用",],
    "size_range": [
        [(0,0),(0,0),(0,60),(60,60),(60,1000000)],
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
    ],
    "analysis": [[
        "可能影响精子释放与活动",
        "一般无临床意义。",
        "说明前列腺功能良好,有利于精子运动。",
        "可能为前列腺轻度功能波动。",
        "可能提示前列腺功能异常或黏液成分异常"
    ],]
}
sperm_status_phValue = {
    "name": "酸碱度(PH)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        [(0,7.2),(7.2,7.2),(7.2,14),(14,14),(14,14)],
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
    ],
    "analysis": [[
        "不利于精子生存与运动",
        "可能提示饮食或轻度炎症影响",
        "说明精液环境适合精子存活和活动。",
        "可能与炎症或饮食有关。",
        "可能与前列腺炎或生殖道感染有关"
    ],]
}
sperm_status_whiteBloodCellConcentration = {
    "name": "白细胞浓度(WBC)",
    "unit": "million/ml",
    "stage": ["通用",],
    "size_range": [
        [(0,0),(0,0),(0,1),(1,1),(1,1000000)], 
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
    ],
    "analysis": [[
        "提示免疫功能或检测误差可能性",
        "一般无异常,属正常波动",
        "说明未见明显泌尿生殖系统感染迹象。",
        "提示可能存在轻度炎症或感染倾向。",
        "提示存在泌尿生殖系统感染"
    ],]
}
sperm_status_spermConcentration = {
    "name": "精子浓度(Concentration)",
    "unit": "million/ml",
    "stage": ["通用",],
    "size_range": [
        [(0,15),(15,15),(15,1000000),(1000000,1000000),(1000000,1000000)], 
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
    ],
    "analysis": [[
        "提示生精功能受损或睾丸功能异常",
        "可能为暂时性因素影响生精功能",
        "说明睾丸生精功能良好。",
        "一般无明显临床意义。",
        "需排查精液浓缩等异常情况"
    ],]
}
sperm_status_totalSpermCount = {
    "name": "总精子数(Total Concentration)",
    "unit": "million",
    "stage": ["通用",],
    "size_range": [
        [(0,39),(39,39),(39,1000000),(1000000,1000000),(1000000,1000000)],
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
    ],
    "analysis": [[
        "可能导致生育能力下降",
        "需结合其他生殖指标观察",
        "说明生精功能与输精通道畅通。",
        "可能为性活动间隔时间较长所致",
        "可能为慢性炎症刺激或激素异常"
    ],]
}
sperm_status_totalSpermMotility = {
    "name": "精子总活力(Motility)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0,40),(40,40),(40,100),(100,100),(100,100)],
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
    ],
    "analysis":[[
        "提示精子活性差,影响受精能力",
        "可能受疲劳、饮食或压力影响",
        "说明精子健康、具备受精能力。",
        "通常属于良性指标波动",
        "可能与激素水平波动有关"
    ],]
}
sperm_status_progressiveSpermPercentage = {
    "name": "前向精子百分率(Progressive motile)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0,32),(32,32),(32,100),(100,100),(100,100)],
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
    ],
    "analysis":[[
        "严重影响精子的受精潜能",
        "提示运动能力稍弱",
        "说明精子运动能力良好。",
        "属于正常波动范围",
        "需结合形态及活力综合评估"
    ],]
}
sperm_status_normalSpermMorphologyRate = {
    "name": "精子正常形态率(Morphology)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0,4),(4,4),(4,100),(100,100),(100,100)], 
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
    ],
    "analysis":[[
        "提示精子畸形率高,影响受孕率",
        "可能提示生精质量轻微下降",
        "说明精子结构正常,有利于受孕。",
        "通常反映良好的生精状态",
        "通常反映良好的生精状态"
    ],]
}
sperm_status_hemoglobinA = {
    "name": "血红蛋白A(HBA)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0,65),(65,65),(65,100),(100,100),(100,100)],  
    ],
    "size_category": [
        ["过低","偏低","正常","偏高","过高"],
    ],
    "analysis":[[
        "可能提示贫血或代谢异常",
        "可能与营养状态有关",
        "说明血液代谢情况良好。",
        "需结合代谢指标进一步判断",
        "可能提示糖代谢紊乱或潜在慢性病"
    ],]
}
# sperm_status_dnaFragmentationIndex = {
#     "name": "DNA碎片化指数(DFI)",
#     "unit": "%",
#     "stage": ["通用",],
#     "size_range": [
#         [(0,0),(0,0),(0,22.5),(22.5,22.5),(22.5,100)],  
#     ],
#     "size_category": [
#         ["过低","偏低","正常","偏高","过高"],
#     ],
#     "analysis":[[
#         "精子DNA完整性良好,遗传物质稳定",
#         "无临床不良意义",
#         "说明精子DNA完整性良好,遗传物质稳定。",
#         "可能受环境或生活方式影响",
#         "可能影响受精率及胚胎质量"
#     ],]
# }
sperm_status_A = {
    "name": "快速前向运动精子（A）",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0,100)]
    ],
    "size_category": [
        ["Placeholder"],
    ],
    "analysis": [[
        "Placeholder",
    ],]
}
sperm_status_B = {
    "name": "慢速前向运动精子（B）",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0,100)]
    ],
    "size_category": [
        ["Placeholder"],
    ],
    "analysis": [[
        "Placeholder",
    ],]
}

# 精子报告 gather列表
sperm_status_gather = [
    sperm_status_semenVolume,
    sperm_status_liquefactionTime,
    sperm_status_phValue,
    sperm_status_whiteBloodCellConcentration,
    sperm_status_spermConcentration,
    sperm_status_totalSpermCount,
    sperm_status_totalSpermMotility,
    sperm_status_progressiveSpermPercentage,
    sperm_status_normalSpermMorphologyRate,
    sperm_status_hemoglobinA,
    # sperm_status_dnaFragmentationIndex,
    sperm_status_A,
    sperm_status_B
]

# =============================================
# 检测项目：国内B超规则 (bUltrasound_Chinese)
# 检测编号：4
# 指标数量：2
# =============================================
bUltrasound_Chinese_endometrial = {
    "name": "子宫内膜厚度",
    "unit": "mm",
    "stage": ["通用",],
    "size_range": [
        [(0,4), (4,4), (4,16), (16,16), (16,1000000)],   #取卵阶段
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "说明可能是雌激素水平不足。",
        "",
        "说明雌激素水平达标。",
        "",
        "说明可能是雌激素水平偏高,或者存在病变(如多囊卵巢综合征),建议进一步检查。"
    ],]
}
bUltrasound_Chinese_follicle = {
    "name": "卵泡尺寸",
    "unit": "mm",
    "stage": ["通用",],
    "size_range": [
        [(0,8), (8,16), (16,24), (24,28), (28,1000000)],    #取卵阶段
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "说明卵子未成熟,可能是初级卵泡或早期窦卵泡,尚未进入促排卵周期的快速生长期。",
        "说明卵泡仍处于生长期,尚未达到成熟标准。",
        "说明卵泡成熟,卵子完成减数分裂,具备受精能力。此范围内的卵泡受精率和胚胎发育潜能最高。",
        "说明卵泡过度成熟,卵子可能开始老化。",
        "说明卵泡超成熟或黄素化,卵子多已老化或退化。"
    ],]
}

# 国内B超 gather列表
bUltrasound_Chinese_gather = [
    bUltrasound_Chinese_endometrial,
    bUltrasound_Chinese_follicle
]


# =============================================
# 检测项目：泰国B超规则 (bUltrasound_Thailand)
# 检测编号：5
# 指标数量：2
# =============================================
### 两个指标,但是每个指标都是列表
bUltrasound_Thailand_endometrial = {
    "name": "子宫内膜厚度",
    "unit": "mm",
    "stage": ["通用",],
    "size_range": [
        [(0,4), (4,4), (4,16), (16,16), (16,1000000)],   #取卵阶段
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "说明可能是雌激素水平不足。",
        "",
        "说明雌激素水平达标。",
        "",
        "说明可能是雌激素水平偏高,或者存在病变(如多囊卵巢综合征),建议进一步检查。"
    ],]
}
bUltrasound_Thailand_follicle = {
    "name": "卵泡尺寸",
    "unit": "mm",
    "stage": ["通用",],
    "size_range": [
        [(0,8), (8,16), (16,24), (24,28), (28,1000000)],    #取卵阶段
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "说明卵子未成熟,可能是初级卵泡或早期窦卵泡,尚未进入促排卵周期的快速生长期。",
        "说明卵泡仍处于生长期,尚未达到成熟标准。",
        "说明卵泡成熟,卵子完成减数分裂,具备受精能力。此范围内的卵泡受精率和胚胎发育潜能最高。",
        "说明卵泡过度成熟,卵子可能开始老化。",
        "说明卵泡超成熟或黄素化,卵子多已老化或退化。"
    ],]
}

# 泰国B超 gather列表
bUltrasound_Thailand_gather = [
    bUltrasound_Thailand_endometrial,
    bUltrasound_Thailand_follicle
]


# =============================================
# 检测项目：免疫五项 (immuno_five)
# 检测编号：6
# 指标数量：5
# =============================================
immuno_five_IgG = {
    "name": "免疫球蛋白G(IgG)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 7.0), (7.0, 9.25), (9.25, 14.75), (14.75, 16.0), (16.0, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "免疫功能偏弱,感染风险略有增加",
        "轻度免疫抑制、营养不良、化疗药物引起感染风险略增。", 
        "免疫功能正常,无明显异常。",
        "慢性感染或炎症引起轻度升高。",
        "可能与慢性炎症或免疫调节变化相关,高免疫活性"
    ],]
}

immuno_five_IgA = {
    "name": "免疫球蛋白A(IgA)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.7), (0.7, 1.18), (1.18, 2.82), (2.82, 4.0), (4.0, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "黏膜防御功能偏弱,呼吸道、消化道感染风险略增",
        "感染、营养缺乏引起轻度免疫低下。",
        "免疫功能正常。",
        "炎症导致轻度升高。",
        "可能与过敏性问题或慢性炎症相关,需结合具体表现排查"
    ],]
}
immuno_five_IgM = {
    "name": "免疫球蛋白M(IgM)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.4), (0.4, 0.78), (0.78, 1.62), (1.62, 2.3), (2.3, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "早期感染防御能力偏弱,对部分细菌的抵抗力稍降",
        "病毒感染引起轻度波动。",
        "免疫功能正常。",
        "肝炎引起轻度升高。",
        "可能与慢性炎症或代谢变化相关,需结合其他检查判断"
    ],]
}
immuno_five_C3 = {
    "name": "补体C3(C3)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.9), (0.9, 1.13), (1.13, 1.57), (1.57, 1.8), (1.8, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "免疫复合物病、感染、遗传缺乏导致补体消耗快。",
        "肾病引起轻度补体降低。",
        "补体系统正常。",
        "肥胖相关轻度升高。",
        "心血管风险增加、炎症加剧。"
    ],]
}

immuno_five_C4 = {
    "name": "补体C4(C4)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.1), (0.1, 0.18), (0.18, 0.32), (0.32, 0.4), (0.4, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "免疫复合物清除能力稍弱,可能与免疫调节异常相关",
        "自身免疫引起轻度降低。",
        "补体系统正常。",
        "代谢综合征轻度升高。",
        "心血管疾病风险高、易导致基因变异。"
    ],]
}

# 免疫五项 gather列表
immuno_five_gather = [
    immuno_five_IgG,
    immuno_five_IgA,
    immuno_five_IgM,
    immuno_five_C3,
    immuno_five_C4
]

# =============================================
# 检测项目：凝血功能四项 (coag_function)
# 检测编号：7
# 指标数量：9
# =============================================

coag_function_PT = {
    "name": "凝血酶原时间(PT)",
    "unit": "s",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 9.8), (9.8, 10.45), (10.45, 11.45), (11.45, 12.1), (12.1, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "凝血速度偏快,血栓风险轻微增加",
        "凝血功能轻度活跃,多为生理性或轻微应激导致,无明显不良影响",
        "凝血正常。",
        "凝血速度略慢,可能与维生素 K 摄入不足相关,出血风险轻微上升",
        "凝血功能偏慢,出血风险略有增加"
    ],]
}
coag_function_PT_R = {
    "name": "凝血酶原时间比值(PT-R)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.82), (0.82, 0.9), (0.9, 1.07), (1.07, 1.15), (1.15, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "高凝、维生素K过多。",
        "异常轻度。",
        "比率正常。",
        "抗凝轻度。",
        "凝血功能偏慢,出血风险略有增加"
    ],]
}
coag_function_PT1 = {
    "name": "凝血酶原时间活动度(PT%)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 80.0), (80.0, 95.0), (95.0, 105.0), (105.0, 120.0), (120.0, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "因子缺乏、肝病导致凝血因子低。",
        "维生素K缺乏轻度。",
        "活动度正常。",
        "炎症轻度升高。",
        "妊娠、炎症导致高活动。"
    ],]
}
coag_function_PT_INR = {
    "name": "凝血酶原国际标准化比值(PT-INR)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.8), (0.8, 0.95), (0.95, 1.15), (1.15, 1.3), (1.3, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "凝血相对偏快,可能与轻微应激或炎症相关,血栓风险轻微增加",
        "轻度。",
        "INR正常。",
        "出血风险轻度。",
        "凝血功能偏慢,出血风险增加"
    ],]
}
coag_function_APTT = {
    "name": "活化部分凝血活酶时间(APTT)",
    "unit": "s",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 22.7), (22.7, 25.23), (25.23, 29.28), (29.28, 31.8), (31.8, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "因子VIII高、狼疮抗凝导致高凝。",
        "高凝轻度。",
        "内在途径正常。",
        "肝病、海肝素轻度延长。",
        "因子缺乏、DIC、肝病导致出血倾向。"
    ],]
}
coag_function_TT = {
    "name": "凝血酶时间(TT)",
    "unit": "s",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 14.0), (14.0, 16.25), (16.25, 18.75), (18.75, 21.0), (21.0, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "高纤维蛋白原导致快速凝血。",
        "轻度。",
        "纤维蛋白正常。",
        "低纤维蛋白轻度延长。",
        "DIC、海肝素、低纤维蛋白原血症导致凝血障碍。"
    ],]
}
coag_function_AT_III = {
    "name": "抗凝血酶III(AT-III)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 80.0), (80.0, 95.0), (95.0, 105.0), (105.0, 120.0), (120.0, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "抗凝能力偏弱,血栓形成风险轻微增加",
        "消耗轻度。",
        "抗凝正常。",
        "炎症轻度升高。",
        "抗凝能力增强,出血风险略有增加"
    ],]
}

coag_function_D_D = {
    "name": "D-二聚体(D-D)",
    "unit": "mg/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.55), (0.55, 1.8), (1.8, 3.6), (3.6, 6.6), (6.6, 1000000.0)],
        ],
    "size_category": [
        ["正常","低风险","中风险","高风险","极高风险"],
    ],
    "analysis": [[
        "正常无血栓。",
        "低风险血栓形成。",
        "无明显风险。",
        "中高风险血栓。",
        "凝血-纤溶活动增强,易导致高血栓事件"
    ],]
}
coag_function_FIB = {
    "name": "纤维蛋白原(FIB)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 1.8), (1.8, 2.38), (2.38, 3.23), (3.23, 3.5), (3.5, 1000000.0)],
        ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "DIC、肝病、遗传缺乏导致低纤维蛋白。",
        "消耗轻度。",
        "纤维蛋白正常。",
        "炎症轻度升高。",
        "凝血底物增多,凝血倾向增强,血栓风险略有增加,多与慢性炎症相关"
    ],]
}

coag_function_INR = {
    "name": "国际标准化比值(INR)",
    "unit": "未知",
    "stage": ["通用",],
    "size_range": [
        [],
        ],
    "size_category": [
        [],
    ],
    "analysis": [[

    ],]
}

# 凝血功能四项 gather列表
coag_function_gather = [
    coag_function_PT,
    coag_function_PT_R,
    coag_function_PT1,
    coag_function_PT_INR,
    coag_function_APTT,
    coag_function_TT,
    coag_function_AT_III,
    coag_function_D_D,
    coag_function_FIB,
    coag_function_INR
]

# =============================================
# 检测项目：肾功 (renal_function)
# 检测编号：8
# 指标数量：6
# =============================================
renal_function_Urea = {
    "name": "尿素(Urea)",
    "unit": "mmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 1.7), (1.7, 3.68), (3.68, 6.12), (6.12, 8.3), (8.3, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "尿素偏低,多为生理性或营养状态导致",
        "尿素略偏低,蛋白质代谢处于低水平,无明显肾功能异常,无需特殊处理",
        "肾功能正常,蛋白质代谢与排泄平衡",
        "尿素轻度升高,肾脏排泄压力轻微增加",
        "尿素偏高,肾脏排泄功能可能偏弱"
    ],]
}
renal_function_UA = {
    "name": "尿酸(UA)",
    "unit": "μmol/L",
    "stage": ["男性","女性"],
    "size_range": [
        [(0, 202),(202, 255.5),(255.5, 364.5),(364.5, 416.00),(416.00, 1000000)],   #男
        [(0, 412.00),(142.00, 191.25),(191.25, 289.75),(289.75, 339.00),(339.00, 1000000)],    #女
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [
    [
        "尿酸偏低,多与营养吸收不足或肝脏代谢相关,无明显健康风险",
        "尿酸略偏低,嘌呤代谢处于低水平,属于正常波动范围,无需担心",
        "代谢正常。",
        "痛风风险轻度。",
        "尿酸偏高,嘌呤代谢异常或排泄不足,痛风及肾结石风险略有增加"
    ],
    [
        "尿酸偏低,多与营养吸收不足或肝脏代谢相关,无明显健康风险",
        "尿酸略偏低,嘌呤代谢处于低水平,属于正常波动范围,无需担心",
        "代谢正常。",
        "痛风风险轻度。",
        "尿酸偏高,嘌呤代谢异常或排泄不足,痛风及肾结石风险略有增加"
    ],
    ]
}
renal_function_Cr = {
    "name": "肌酐(Cr)",
    "unit": "μmol/L",
    "stage": ["男性","女性"],
    "size_range": [
        [(0, 59),(59, 70.25),(70.25, 92.75),(92.75, 104),(104, 1000000)],  # 男
        [(0, 45),(45, 54.75),(54.75, 74.25),(74.25, 84),(84, 1000000)],    # 女
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [
    [
        "肌酐偏低,可能与肌肉量少、营养不足相关,",
        "营养不良轻度。",
        "肾功能正常。",
        "肾损伤轻度。",
        "肌酐偏高,肾小球滤过功能可能偏弱,或与运动过量、脱水相关"
    ],
    [
        "肌酐偏低,可能与肌肉量少、营养不足相关,",
        "营养不良轻度。",
        "肾功能正常。",
        "肾损伤轻度。",
        "肌酐偏高,肾小球滤过功能可能偏弱,或与运动过量、脱水相关"
    ],
    ]
}
renal_function_CYSC = { 
    "name": "胱抑素C(CysC)",
    "unit": "mg/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.55), (0.55, 0.76), (0.76, 1.34), (1.34, 1.55), (1.55, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "胱抑素 C 偏低,多为个体代谢差异,无肾功能相关异常",
        "胱抑素 C 略偏低,肾小球滤过功能处于较高水平,属于正常状态",
        "肾功能正常。",
        "胱抑素 C 轻度升高,肾小球滤过功能可能轻微下降,多为暂时性调节变化",
        "胱抑素 C 偏高,肾小球滤过功能可能减弱"
    ],]
}
renal_function_CO2 = { 
    "name": "二氧化碳结合力(CO2-CP)",
    "unit": "mmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 22.0), (22.0, 24.25), (24.25, 26.75), (26.75, 29.0), (29.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "CO₂偏低,可能与轻度代谢性酸中毒相关,或与呼吸过快、腹泻导致碱丢失相关",
        "CO₂略偏低,体内酸碱平衡轻度偏移,多为暂时性,无需特殊处理",
        "酸碱平衡正常,体内二氧化碳调节功能良好",
        "CO₂轻度升高,可能与轻度代谢性碱中毒相关,或与呼吸偏慢、呕吐导致碱积存相关",
        "CO₂偏高,体内酸碱平衡偏移,需注意排查呼吸或代谢相关问题"
    ],]
}
renal_function_GLU = { 
    "name": "葡萄糖(GLU)",
    "unit": "mmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 3.9), (3.9, 4.65), (4.65, 5.35), (5.35, 6.1), (6.1, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "血糖偏低,可能与进食不足、运动过量相关,易出现乏力、头晕,及时补充能量即可",
        "血糖略偏低,糖代谢处于低水平,属于正常波动,无低血糖相关风险",
        "糖代谢正常。",
        "血糖轻度升高,糖耐量可能轻微异常,需注意饮食控制,定期监测",
        "血糖偏高,糖代谢可能异常,糖尿病风险略有增加,建议进一步做糖耐量检查"
    ],]
}

# 肾功 gather列表
renal_function_gather = [
    renal_function_Urea,
    renal_function_UA,
    renal_function_Cr,
    renal_function_CYSC,
    renal_function_CO2,
    renal_function_GLU
]

# =============================================
# 检测项目：血型 (blood_type)
# 检测编号：9
# 指标数量：2
# =============================================

blood_type_ABO = { 
    "name": "ABO血型(ABO)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["A型", "B型", "AB型","O型"],
    ],
    "size_category": [
        ["A型", "B型", "AB型","O型"],
    ],
    "analysis": [[
        "暂无",
        "暂无",
        "暂无",
        "暂无",
    ],]
}
blood_type_RH = { 
    "name": "Rh血型(Rh)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["阴性", "阳性"],
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "暂无",
        "暂无",
    ],]
}

# 血型 gather列表
blood_type_gather = [
    blood_type_ABO,
    blood_type_RH
]

# =============================================
# 检测项目：血常规 (blood_routine)
# 检测编号：10
# 指标数量：28
# =============================================
blood_routine_WBC = { 
    "name": "白细胞计数(WBC)",
    "unit": "×10⁹/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 3.5), (3.5, 5.38), (5.38, 7.62), (7.62, 9.5), (9.5, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "免疫防御能力偏弱,可能与病毒感染、轻度骨髓抑制相关,感染风险轻微增加",
        "多为个体差异或轻微感染恢复期,无明显免疫异常",
        "免疫正常。",
        "炎症轻度升高。",
        "免疫防御系统活跃,多与急性感染、应激相关"
    ],]
}
blood_routine_RDW_CV = { 
    "name": "红细胞分布宽度变异系数(RDW-CV)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 11.9), (11.9, 12.65), (12.65, 13.75), (13.75, 14.5), (14.5, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "红细胞大小较均匀,多为生理性,无明显贫血相关异常",
        "轻度。",
        "红细胞均匀。",
        "混合性贫血轻度。",
        "红细胞大小差异明显,可能与缺铁性贫血、营养缺乏相关"
    ],]
}
blood_routine_RBC = { 
    "name": "红细胞计数(RBC)",
    "unit": "×10¹²/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 4.3), (4.3, 4.88), (4.88, 5.42), (5.42, 5.8), (5.8, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "贫血、出血导致低红细胞。",
        "铁缺乏轻度。",
        "携氧正常。",
        "脱水轻度升高。",
        "吸烟、多血症、肾肿瘤导致血栓风险。"
    ],]
}
blood_routine_PLT = { 
    "name": "血小板计数(PLT)",
    "unit": "×10⁹/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 125.0), (125.0, 206.25), (206.25, 268.75), (268.75, 350.0), (350.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "凝血功能偏弱,出血风险轻微增加",
        "病毒感染轻度。",
        "止血正常。",
        "炎症轻度升高。",
        "凝血倾向略明显,血栓风险轻微增加"
    ],]
}
blood_routine_PDW = { 
    "name": "血小板分布宽度(PDW)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 8.0), (8.0, 10.5), (10.5, 15.5), (15.5, 18.0), (18.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "骨髓抑制导致低分布。",
        "轻度。",
        "血小板均匀。",
        "血小板异质性轻度。",
        "血小板大小差异明显,可能与骨髓造血功能轻度波动相关"
    ],]
}
blood_routine_PCT = { 
    "name": "血小板压积(PCT)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.11), (0.11, 0.163), (0.163, 0.227), (0.227, 0.28), (0.28, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "血小板总体积不足,可能与血小板数量减少相关,凝血支撑轻度不足",
        "轻度。",
        "血小板体积正常。",
        "血小板增多轻度。",
        "血小板总体积增多,可能加大血栓风险、加剧炎症。"
    ],]
}
blood_routine_NEU1 = { 
    "name": "中性粒细胞百分比(NEU%)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 40.0), (40.0, 52.5), (52.5, 62.5), (62.5, 75.0), (75.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "中性粒细胞占比偏低,可能与病毒感染、轻度免疫抑制相关,细菌感染防御能力轻微下降",
        "免疫抑制轻度。",
        "抗菌正常。",
        "可能与近期轻微细菌感染、炎症相关",
        "细菌感染防御系统活跃,可能存在急性细菌感染相关疾病"
    ],]
}
blood_routine_NEU2 = { 
    "name": "中性粒细胞计数(NEU#)",
    "unit": "×10⁹/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 1.8), (1.8, 3.23), (3.23, 4.77), (4.77, 6.3), (6.3, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "细菌感染防御能力偏弱,可能与病毒感染、骨髓轻度抑制相关",
        "免疫抑制轻度。",
        "抗菌正常。",
        "细菌感染前期。",
        "细菌感染防御系统活跃,多与急性感染、应激相关"
    ],]
}
blood_routine_MPV = { 
    "name": "平均血小板体积(MPV)",
    "unit": "fL",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 6.0), (6.0, 7.0), (7.0, 9.0), (9.0, 10.0), (10.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "血小板体积偏小,可能与血小板生成不足相关,凝血功能轻度偏弱",
        "抑制轻度。",
        "血小板功能正常。",
        "ITP、炎症轻度大。",
        "血小板体积偏大,可能与血小板生成加速相关,可能导致出血现象"
    ],]
}
blood_routine_MON2 = { 
    "name": "单核细胞计数(MON#)",
    "unit": "×10⁹/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.1), (0.1, 0.23), (0.23, 0.47), (0.47, 0.6), (0.6, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "多为个体代谢差异,无明显免疫异常",
        "属于正常波动范围",
        "慢性感染监测正常。",
        "可能与近期轻微感染、炎症恢复期相关",
        "吞噬功能活跃,多与慢性感染、炎症相关"
    ],]
}
blood_routine_MON1 = { 
    "name": "单核细胞百分比(MON%)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 3.0), (3.0, 4.75), (4.75, 8.25), (8.25, 10.0), (10.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "多为生理性波动,无明显免疫功能异常",
        "属于正常调节范围,无需过度担心",
        "慢性感染监测正常。",
        "可能与近期感染、炎症相关",
        "单核细胞占比偏高,吞噬功能活跃,多与慢性感染、炎症相关"
    ],]
}
blood_routine_MCV = { 
    "name": "平均红细胞体积(MCV)",
    "unit": "fL",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 82.0), (82.0, 88.5), (88.5, 95.5), (95.5, 100.0), (100.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "红细胞体积偏小,可能与缺铁性贫血、营养缺乏相关",
        "红细胞体积轻度偏小,多为营养不均衡导致,无明显贫血症状",
        "红细胞大小正常。",
        "红细胞体积轻度偏大,可能与叶酸、维生素 B12 轻度缺乏相关",
        "红细胞体积偏大,可能与巨幼细胞性贫血相关"
    ],]
}
blood_routine_MCHC = { 
    "name": "平均红细胞血红蛋白浓度(MCHC)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 316.0), (316.0, 329.0), (329.0, 341.0), (341.0, 354.0), (354.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "红细胞内血红蛋白浓度不足,可能与缺铁性贫血相关",
        "多为营养轻微不足导致,无明显贫血风险",
        "血红蛋白浓度正常。",
        "红细胞内血红蛋白浓度轻度偏高,属于正常波动",
        "红细胞内血红蛋白浓度偏高,可能与脱水、血液浓缩相关"
    ],]
}
blood_routine_HCH = { 
    "name": "红细胞血红蛋白含量(HCH)",
    "unit": "pg",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 27.0), (27.0, 29.25), (29.25, 32.75), (32.75, 34.0), (34.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "单个红细胞内血红蛋白不足,可能与缺铁性贫血相关",
        "多为营养轻微不均衡导致,轻度贫血",
        "血红蛋白正常。",
        "单个红细胞血红蛋白轻度偏高,属于正常波动范围",
        "单个红细胞血红蛋白偏高,可能与叶酸、维生素 B12 缺乏相关"
    ],]
}
blood_routine_LYM2 = { 
    "name": "淋巴细胞计数(LYM#)",
    "unit": "×10⁹/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 1.1), (1.1, 1.68), (1.68, 2.72), (2.72, 3.2), (3.2, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "病毒感染防御能力偏弱,可能与免疫抑制、轻度骨髓功能相关",
        "多为个体差异或感染恢复期,无明显免疫异常",
        "病毒防御正常。",
        "可能与近期病毒感染相关,免疫应答温和激活",
        "病毒感染防御系统活跃,多与急性病毒感染相关"
    ],]
}
blood_routine_LYM1 = { 
    "name": "淋巴细胞百分比(LYM%)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 20.0), (20.0, 27.5), (27.5, 42.5), (42.5, 50.0), (50.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "可能与细菌感染、轻度免疫抑制相关,病毒感染防御能力轻微下降",
        "多为正常波动或细菌感染恢复期",
        "病毒防御正常。",
        "可能与近期病毒感染相关",
        "病毒感染防御系统活跃,多与急性病毒感染相关"
    ],]
}
blood_routine_HGB = { 
    "name": "血红蛋白(HGB)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 130.0), (130.0, 146.25), (146.25, 158.75), (158.75, 175.0), (175.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "存在贫血,携氧能力下降,可能与营养不足、失血相关",
        "贫血轻度。",
        "携氧正常。",
        "多血轻度。",
        "血液浓缩或造血略活跃,可能与脱水、缺氧相关,需补充水分复查"
    ],]
}
blood_routine_HCT = { 
    "name": "红细胞比容(HCT)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 35.0), (35.0, 38.25), (38.25, 41.75), (41.75, 45.0), (45.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "贫血、出血导致低压积。",
        "铁缺乏轻度。",
        "血容量正常。",
        "脱水轻度升高。",
        "血液浓缩明显,可能与脱水、缺氧相关,需补充水分后复查"
    ],]
}
blood_routine_EO1 = { 
    "name": "嗜酸性粒细胞百分比(EO%)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.4), (0.4, 1.3), (1.3, 5.1), (5.1, 8.0), (8.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "多为生理性波动或轻微应激导致",
        "轻度。",
        "抗寄生正常。",
        "过敏前期。",
        "抗过敏、抗寄生虫功能活跃,多与过敏性疾病、寄生虫感染相关"
    ],]
}
blood_routine_EO2 = { 
    "name": "嗜酸性粒细胞计数(EO#)",
    "unit": "×10⁹/L",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.02), (0.02, 0.143), (0.143, 0.377), (0.377, 0.52), (0.52, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "多为生理性波动或轻微应激导致",
        "轻度。",
        "抗寄生正常。",
        "过敏前期。",
        "可能与过敏性疾病、寄生虫感染相关"
    ],]
}
blood_routine_BAS2 = {
    "name": "嗜碱性粒细胞计数(BAS#)",
    "unit": "×10⁹/L",
    "stage": ["通用",], 
    "size_range": [
        [(0.0, 0.0), (0.0, 0.015), (0.015, 0.45), (0.045, 0.06), (0.06, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "无临床意义,多为检测误差,无需关注",
        "数值处于低水平,属于正常波动范围",
        "过敏反应正常。",
        "数值轻度升高,可能与轻微过敏、炎症相关",
        "数值偏高,可能与过敏性疾病、骨髓造血轻微波动相关,需结合其他指标判断"
    ],]
}
blood_routine_BAS1 = { 
    "name": "嗜碱性粒细胞百分比(BAS%)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.0), (0.0, 0.25), (0.25, 0.75), (0.75, 1.0), (1.0, 1000000.0)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "无临床意义,多为检测误差,无需关注",
        "数值处于低水平,属于正常调节范围",
        "过敏反应正常。",
        "数值轻度升高,可能与轻微过敏相关",
        "可能与过敏性疾病、骨髓功能轻微异常相关,需结合症状排查"
    ],]
}


# 未补充
blood_routine_IG1 = { 
    "name": "未成熟粒细胞百分比(IG%)", 
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [],
    ],
    "size_category": [
        [],
    ],
    "analysis": [[

    ],]
}
blood_routine_IG2 = { 
    "name": "未成熟粒细胞计数(IG)",
    "unit": "×10⁹/L",
    "stage": ["通用",],
    "size_range": [
        [],
    ],
    "size_category": [
        [],
    ],
    "analysis": [[

    ],]
}
blood_routine_MCH = { 
    "name": "平均红细胞血红蛋白量(MCH)", 
    "unit": "×10⁹/L",
    "stage": ["通用",],
    "size_range": [
        [],
    ],
    "size_category": [
        [],
    ],
    "analysis": [[

    ],]
}
blood_routine_RDW = { 
    "name": "红细胞分布宽度(RDW)", 
    "unit": "×10⁹/L",
    "stage": ["通用",],
    "size_range": [
        [],
    ],
    "size_category": [
        [],
    ],
    "analysis": [[

    ],]
}
blood_routine_NRBC2 = { 
    "name": "有核红细胞计数(NRBC#)",
    "unit": "×10⁹/L",
    "stage": ["通用",],
    "size_range": [
        [],
    ],
    "size_category": [
        [],
    ],
    "analysis": [[

    ],]
}

blood_routine_NRBC1 = { 
    "name": "有核红细胞百分比(NRBC%)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [],
    ],
    "size_category": [
        [],
    ],
    "analysis": [[

    ],]
}

# 血常规指标 gather列表（核心需求）
blood_routine_gather = [
    blood_routine_WBC,
    blood_routine_RDW_CV,        
    blood_routine_RBC,
    blood_routine_PLT,
    blood_routine_PDW,
    blood_routine_PCT,
    blood_routine_NEU1,
    blood_routine_NEU2,
    blood_routine_MPV,
    blood_routine_MON2,
    blood_routine_MON1,
    blood_routine_MCV,
    blood_routine_MCHC,
    blood_routine_HCH,        
    blood_routine_LYM2,
    blood_routine_LYM1,
    blood_routine_HGB,
    blood_routine_HCT,
    blood_routine_EO1,
    blood_routine_EO2,
    blood_routine_BAS2,
    blood_routine_BAS1,
    blood_routine_IG1,
    blood_routine_IG2,
    blood_routine_MCH,        
    blood_routine_RDW,        
    blood_routine_NRBC2,
    blood_routine_NRBC1
]


# =============================================
# 检测项目：衣原体 (ct_dna)
# 检测编号：11
# 指标数量：1
# =============================================
ct_dna_CTDNA = { 
    "name": "衣原体检测(CT-DNA)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["阴性", "阳性"],
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "未检测到衣原体相关病原体,生殖道无相关炎症风险,结果正常",
        "检测到衣原体相关病原体,可能存在轻度生殖道炎症,建议及时咨询医生规范处理"
    ],]
}

# 衣原体 gather列表
ct_dna_gather = [
    ct_dna_CTDNA
]

# =============================================
# 检测项目：传染病四项 (infectious_disease)
# 检测编号：12
# 指标数量：8
# =============================================
infectious_disease_HBsAg = { 
    "name": "乙肝表面抗原(HBsAg)",
    "unit": "IU/mL",
    "stage": ["通用",],
    "size_range": [
        [(0,0.05),(0.05-0.05),(0.05-1000000)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到乙肝病毒表面抗原,无乙肝病毒感染相关迹象,结果正常",
        "检测结果处于临界范围,可能与样本干扰或检测误差相关,建议 1-3 个月内复查确认",
        "检测到乙肝病毒表面抗原,提示可能存在乙肝病毒感染,建议进一步检查肝功能及病毒载量"
    ],]
}
infectious_disease_HBsAb = { 
    "name": "乙肝表面抗体(HBsAb)",
    "unit": "mIU/mL",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 10.0), (10.0, 10.0), (10.0, 1000000)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到乙肝保护抗体,对乙肝病毒免疫力较弱",
        "抗体水平处于临界值,检测结果不确定,建议复查明确抗体状态",
        "检测到乙肝保护抗体,对乙肝病毒具有免疫防御能力,抗体水平越高,保护效果越稳定"
    ],]
}
infectious_disease_HBeAg = { 
    "name": "乙肝e抗原(HBeAg)",
    "unit": "S/COI",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 1.0), (1.0, 1.0), (1.0, 1000000)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到乙肝e抗原,乙肝病毒复制活跃度较低,传染性相对温和",
        "检测结果临界,可能与病毒低水平复制相关,建议结合乙肝病毒载量综合复查",
        "检测到乙肝e抗原,提示乙肝病毒复制较为活跃,需进一步监测肝功能,咨询医生制定管理方案"
    ],]
}
infectious_disease_HBeAb = { 
    "name": "乙肝e抗体(HBeAb)",
    "unit": "S/COI",
    "stage": ["通用",],
    "size_range": [
        [(1.0, 1000000), (1, 1), (0.0, 1.0)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到乙肝e抗体,需结合乙肝表面抗原、核心抗体等指标,综合判断病毒复制状态",
        "检测结果临界,可能与抗体产生初期相关,建议结合乙肝全套指标复查确认",
        "检测到乙肝e抗体,提示乙肝病毒复制活跃度下降,病情相对稳定,定期监测即可"
    ],]
}
infectious_disease_HBcAb = { 
    "name": "乙肝核心抗体(HBcAb)",
    "unit": "S/COI",
    "stage": ["通用",],
    "size_range": [
        [(0, 1.0),(1, 1), (1.0, 1000000)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到乙肝核心抗体,无乙肝病毒既往感染或现症感染相关痕迹",
        "检测结果临界,可能与既往感染恢复期相关,建议 1-3 个月后复查明确状态",
        "检测到乙肝核心抗体,可能为既往感染或现症感染,需结合表面抗原 / 抗体结果进一步判断"
    ],]
}
infectious_disease_HCV = { 
    "name": "丙肝抗体(Anti-HCV)",
    "unit": "COI",
    "stage": ["通用",],
    "size_range": [
        [(0, 1.0),(1, 1), (1.0, 1000000)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到丙肝病毒抗体,无丙肝病毒暴露相关迹象,结果正常",
        "检测结果临界,可能与检测干扰或感染窗口期相关,建议 1-3 个月后复查丙肝病毒 RNA",
        "检测到丙肝病毒抗体,提示可能存在丙肝病毒感染,建议进一步检查丙肝病毒 RNA 明确诊断"
    ],]
}
infectious_disease_HIV = { 
    "name": "艾滋抗体(Anti-HIV)",
    "unit": "COI",
    "stage": ["通用",],
    "size_range": [
        [(0, 1.0), (1, 1), (1.0, 1000000)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到 HIV 抗体,无相关病毒感染相关迹象,结果正常",
        "检测结果临界,可能处于感染窗口期或检测误差,建议按医生指导定期复查确认",
        "检测结果为阳性,期间请勿恐慌,及时联系感染科医生评估"
    ],]
}
infectious_disease_TPAb = { 
    "name": "梅毒螺旋体抗体(TPAb)",
    "unit": "COI",
    "stage": ["通用",],
    "size_range": [
        [(0, 1.0), (1, 1), (1.0, 1000000)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到梅毒螺旋体抗体,无梅毒感染相关迹象,结果正常",
        "检测结果临界,可能与检测干扰相关,建议复查梅毒非特异性抗体确认",
        "检测到梅毒螺旋体抗体,提示可能存在梅毒感染,建议进一步做滴度检测",
    ],]
}

# 传染病指标 gather列表（核心需求）
infectious_disease_gather = [
    infectious_disease_HBsAg,
    infectious_disease_HBsAb,
    infectious_disease_HBeAg,
    infectious_disease_HBeAb,
    infectious_disease_HBcAb,
    infectious_disease_HCV,
    infectious_disease_HIV,
    infectious_disease_TPAb
]
# =============================================
# 检测项目：优生五项TORCH (torch)
# 检测编号：13
# 指标数量：12
# =============================================
torch_CMV_IgM = {
    "name": "巨细胞病毒IgM(CMV-IgM)",
    "unit": "AU/ml",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 22.0), (22.0, 22.0), (22.0, 1000000)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到近期巨细胞病毒感染相关抗体,无近期感染迹象,结果适合备孕",
        "检测结果处于临界范围,可能与检测干扰或早期感染相关,建议 2-4 周后复查确认",
        "检测到近期巨细胞病毒感染相关抗体,可能存在急性感染,建议咨询医生评估胎儿感染风险",
    ],]
}
torch_CMV_IgG = {
    "name": "巨细胞病毒IgG(CMV-IgG)",
    "unit": "IU/ml",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 14.0), (14.0, 14.0), (14.0, 1000000)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到既往巨细胞病毒感染抗体,对该病毒无免疫力,备孕期间需注意防护",
        "检测结果临界,可能为既往感染初期或检测误差,建议复查明确免疫状态",
        "检测到既往巨细胞病毒感染抗体,对该病毒具有一定免疫力,备孕风险较低",
    ],]
}
torch_TOX_IgM = { 
    "name": "弓形体IgM(TOX-IgM)",
    "unit": "AU/ml",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 6.0), (6.0, 8.0), (8.0, 1000000.0)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到近期弓形体感染相关抗体,无近期感染迹象,结果适合备孕",
        "检测结果处于临界范围,可能与检测干扰相关,建议复查并结合接触史评估",
        "检测到近期弓形体感染相关抗体,提示急性感染,需咨询医生评估胎儿畸形风险"
    ],]
}
torch_TOX_IgG = { 
    "name": "弓形体IgG(TOX-IgG)",
    "unit": "IU/ml",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 7.2), (7.2, 8.8), (8.8, 1000000.0)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到既往弓形体感染抗体,对该病原体无免疫力,备孕需避免接触宠物粪便等传染源",
        "检测结果临界,可能为既往感染恢复期,建议复查明确免疫状态",
        "检测到既往弓形体感染抗体,对该病原体具有保护性免疫力,备孕风险较低"
    ],]
}
torch_RV_IgM = { 
    "name": "风疹病毒IgM(RV-IgM)",
    "unit": "AU/ml",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 20.0), (20.0, 15.0), (25.0, 1000000.0)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到近期风疹病毒感染相关抗体,无近期感染迹象,结果适合备孕",
        "检测结果处于临界范围,可能与检测误差相关,建议 1-3 个月后复查确认",
        "检测到近期风疹病毒感染相关抗体,提示急性感染,孕期易导致胎儿致癌,需咨询医生评估"
    ],]
}
torch_RV_IgG = { 
    "name": "风疹病毒IgG(RV-IgG)",
    "unit": "IU/ml",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 5.0), (5.0, 11.0), (11.0, 1000000.0)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到既往风疹病毒感染抗体,对该病毒无免疫力,建议接种风疹疫苗后再备孕",
        "检测结果临界,可能为疫苗接种后抗体水平不足,建议复查并咨询医生是否需要加强接种",
        "检测到既往风疹病毒感染抗体,对该病毒具有免疫保护力,备孕期间无需过度担心"
    ],]
}
torch_HSV_1_IgM = { 
    "name": "单纯疱疹病毒1型IgM(HSV-1-IgM)",
    "unit": "Col",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.9), (0.9, 1.1), (1.1, 1000000.0)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到既往单纯疱疹病毒 I 型感染抗体,对该病毒无免疫力,备孕期间注意防护",
        "检测结果临界,可能为既往感染恢复期,建议复查明确免疫状态",
        "检测到既往单纯疱疹病毒 I 型感染抗体,对该病毒具有一定免疫力,复发风险较低",
    ],]
}
torch_HSV_1_IgG = { 
    "name": "单纯疱疹病毒1型IgG(HSV-1-IgG)",
    "unit": "Col",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.9), (0.9, 1.1), (1.1, 1000000.0)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到既往单纯疱疹病毒 I 型感染抗体,对该病毒无免疫力,备孕期间注意防护",
        "检测结果临界,可能为既往感染恢复期,建议复查明确免疫状态",
        "检测到既往单纯疱疹病毒 I 型感染抗体,对该病毒具有一定免疫力,复发风险较低"
    ],]
}
torch_HSV_2_IgM = { 
    "name": "单纯疱疹病毒2型IgM(HSV-2-IgM)",
    "unit": "Col",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.9), (0.9, 1.1), (1.1, 1000000.0)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到近期单纯疱疹病毒 II 型感染相关抗体,无近期感染迹象,结果适合备孕",
        "检测结果临界,可能与检测误差相关,建议结合生殖道症状复查确认",
        "检测到近期单纯疱疹病毒 II 型感染相关抗体,提示急性生殖器疱疹感染,需规范治疗后再备孕"
    ],]
}
torch_HSV_2_IgG = { 
    "name": "单纯疱疹病毒2型IgG(HSV-2-IgG)",
    "unit": "Col",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.9), (0.9, 1.1), (1.1, 1000000.0)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到既往单纯疱疹病毒 II 型感染抗体,对该病毒无免疫力,备孕期间避免高危接触",
        "检测结果临界,可能为既往感染初期,建议复查明确免疫状态",
        "检测到既往单纯疱疹病毒 II 型感染抗体,备孕期间需注意预防复发,避免孕期感染"
    ],]
}
torch_B19_IgM = { 
    "name": "B19细小病毒IgM(B19-IgM)",
    "unit": "Col",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.9), (0.9, 1.1), (1.1, 1000000.0)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到近期细小病毒 B19 感染相关抗体,无近期感染迹象,结果适合备孕",
        "检测结果临界,可能与检测干扰相关,建议 2-4 周后复查确认",
        "检测到近期细小病毒 B19 感染相关抗体,提示急性感染,可能导致胎儿贫血风险,需咨询医生评估",
    ],]
}
torch_B19_IgG = { 
    "name": "B19细小病毒IgG(B19-IgG)",
    "unit": "Col",
    "stage": ["通用",],
    "size_range": [
        [(0.0, 0.9), (0.9, 1.1), (1.1, 1000000.0)],
    ],
    "size_category": [
        ["阴性", "存疑", "阳性"],
    ],
    "analysis": [[
        "未检测到既往细小病毒 B19 感染抗体,对该病毒无免疫力,备孕期间注意防护",
        "检测结果临界,可能为既往感染恢复期,建议复查明确免疫状态",
        "检测到既往细小病毒 B19 感染抗体,对该病毒具有免疫保护力,备孕风险较低"
    ],]
}

# TORCH筛查指标 gather列表（核心需求）
torch_gather = [
    torch_CMV_IgM,
    torch_CMV_IgG,
    torch_TOX_IgM,
    torch_TOX_IgG,
    torch_RV_IgM,
    torch_RV_IgG,
    torch_HSV_1_IgM,
    torch_HSV_1_IgG,
    torch_HSV_2_IgM,
    torch_HSV_2_IgG,
    torch_B19_IgM,
    torch_B19_IgG
]
# =============================================
# 检测项目：支原体 (mycoplasma)
# 检测编号：14
# 指标数量：2
# =============================================
mycoplasma_Uu = { 
    "name": "解脲支原体(Uu)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ['阴性', '阳性'],
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "未检测到解脲支原体,生殖道无相关病原体感染,结果适合备孕",
        "检测到解脲支原体,可能存在轻度生殖道炎症,若伴随不适症状,建议咨询医生规范治疗后再备孕"
    ],]
}
mycoplasma_Mh = { 
    "name": "人型支原体(Mh)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ['阴性', '阳性'],
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "未检测到人型支原体,无相关病原体感染迹象,结果正常适合备孕",
        "检测到人型支原体,可能引发生殖道或泌尿系统轻度炎症,需咨询医生评估治疗,避免影响受孕"
    ],]
}

# 支原体 gather列表
mycoplasma_gather = [
    mycoplasma_Uu,
    mycoplasma_Mh
]

# =============================================
# 检测项目：HCG妊娠诊断报告(hcg_pregnancy)
# 检测编号：15
# 指标数量：1
# =============================================
hcg_pregnancy_HCG = { 
    "name": "绒毛膜促性腺激素(HCG)",
    "unit": "mIU/mL",
    "stage": ["孕期第一周", "孕期第二周", "孕期第三周", "孕期第四周", "孕期第五周", "孕期第六周", "孕期第七周", "孕期第八周", "孕期第8-12周", "孕期第12-16周", "孕期第16-18周", "未怀孕", "男士"],
    "size_range": [
        [(0, 5), (5, 50), (50, 1000000)],                # 孕期第一周    3-7days
        [(0, 10), (10, 472), (472, 1000000)],            # 孕期第二周    1-2weeks
        [(0, 90), (90, 4590), (4590, 1000000)],          # 孕期第三周    2-3weeks
        [(0, 462), (462, 10940), (10940, 1000000)],      # 孕期第四周    3-4weeks
        [(0, 1065), (1065, 68248), (5682480, 1000000)],  # 孕期第五周    4-5weeks
        [(0, 7458), (7458, 118515), (118515, 1000000)],  # 孕期第六周    5-6weeks
        [(0, 14432), (14432, 175638), (175638, 1000000)],# 孕期第七周    6-7weeks
        [(0, 31510), (31510, 184628), (184628, 1000000)],# 孕期第八周    7-8weeks
        [(0, 28639), (28639, 224919), (224919, 1000000)],# 孕期第8-12周  9-12weeks
        [(0, 9870), (9870, 106917), (106917, 1000000)],  # 孕期第12-16周 13-16weeks
        [(0, 7924), (7924, 56552), (56552, 1000000)],    # 孕期第16-18周 17-18weeks
        [(0, 10), (10, 1000000)],                        # 未怀孕
        [(0, 2), (2, 1000000)],                          # 男士
    ],
    "size_category": [
        ["过小", "正常", "过大"],                         # 孕期第一周    3-7days
        ["过小", "正常", "过大"],                         # 孕期第二周    1-2weeks
        ["过小", "正常", "过大"],                         # 孕期第三周    2-3weeks
        ["过小", "正常", "过大"],                         # 孕期第四周    3-4weeks
        ["过小", "正常", "过大"],                         # 孕期第五周    4-5weeks
        ["过小", "正常", "过大"],                         # 孕期第六周    5-6weeks
        ["过小", "正常", "过大"],                         # 孕期第七周    6-7weeks
        ["过小", "正常", "过大"],                         # 孕期第八周    7-8weeks
        ["过小", "正常", "过大"],                         # 孕期第8-12周  8-12weeks
        ["过小", "正常", "过大"],                         # 孕期第12-16周 12-16weeks
        ["过小", "正常", "过大"],                         # 孕期第16-18周 16-18weeks
        ["正常", "过大"],                         # 未怀孕
        ["正常", "过大"],                         # 男士
    ],
    "analysis": [
    [
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",   # 3-7days
        "指标正常。",
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",
    ],
    [   
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",   # 1-2weeks
        "指标正常。",
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",
    ],
    [
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",   # 2-3weeks
        "指标正常。",
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",
    ],
    [
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",   # 3-4weeks
        "指标正常。",
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",
    ],
    [
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",   # 4-5weeks
        "指标正常。",
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",
    ],
    [
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",   # 5-6weeks
        "指标正常。",
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",
    ],
    [
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",   # 6-7weeks
        "指标正常。",
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",
    ],
    [
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",   # 7-8weeks
        "指标正常。",
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",
    ],
    [
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",   # 8-12weeks
        "指标正常。",
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",
    ],
    [
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",   # 12-16weeks
        "指标正常。",
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",
    ],
    [
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",   # 16-18weeks
        "指标正常。",
        "数值与孕周不符,需遵医嘱排除宫外孕、胚胎发育不良、多胎或葡萄胎等情况。",
    ],
    [
        "未怀孕,指标正常。",   # 未怀孕
        "未怀孕,指标异常,请进一步核查。",
    ],
    [
        "男士,指标正常。",   # 男士
        "男士,指标异常,请进一步核查。",
    ],    
    ]
}

# 该报告包含的所有指标

hcg_pregnancy_gather = [hcg_pregnancy_HCG]


# =============================================
# 检测项目：地中海贫血症("thalassemia")
# 检测编号：16
# 指标数量：3
# =============================================
thalassemia_type_a_3_loss = {
    "name":"a-地贫基因检测(3种缺失型)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ['阴性', '阳性'],
    ],
    "size_category": [
        ["阴性","阳性"],
    ],
    "analysis": [[
        "未携带致病基因,无需处理。",
        "为地中海贫血基因携带者。无需治疗,但若计划生育,必须让伴侣也进行此项检查,并进行遗传咨询。"
    ],]
}
thalassemia_type_a_3_Nonloss = { 
    "name": "a-地贫基因检测(3种非缺失型)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ['阴性', '阳性'],
    ],
    "size_category": [
        ["阴性","阳性"],
    ],
    "analysis": [[
        "未携带致病基因,无需处理。",
        "为地中海贫血基因携带者。无需治疗,但若计划生育,必须让伴侣也进行此项检查,并进行遗传咨询。"
    ],]
}
thalassemia_type_b_17 = { 
    "name": "β-地贫基因检测(17种突变)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ['阴性', '阳性'],
    ],
    "size_category": [
        ["阴性","阳性"],
    ],
    "analysis": [[
        "未携带致病基因,无需处理。",
        "为地中海贫血基因携带者。无需治疗,但若计划生育,必须让伴侣也进行此项检查,并进行遗传咨询。"
    ],]
}

# 该报告包含的所有指标
thalassemia_gather = [
    thalassemia_type_a_3_loss, 
    thalassemia_type_a_3_Nonloss, 
    thalassemia_type_b_17
]

# =============================================
# 检测项目：贫血四项(anemia_four)
# 检测编号：17
# 指标数量：4
# =============================================
anemia_four_Fer = {
    "name":"铁蛋白(Fer)",
    "unit": "ng/ml",
    "stage": ["通用",],
    "size_range": [
        [(0, 4.63),(4.63, 44.50),(44.50, 164.13),(164.13, 204),(204, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
       "提示可能存在严重的缺铁性贫血。必须立即就医,在医生指导下进行大剂量铁剂补充治疗。",
       "提示铁储备不足。增加富含铁的食物(红肉、肝脏),咨询医生补充铁剂。",
       "铁储备充足,保持均衡饮食。",
       "可能与炎症、肝病或铁负荷过高等有关。复查并咨询医生,明确原因。",
       "提示可能存在较严重的潜在疾病。必须就医进行全面检查,确定根本原因。"
    ],]
}
anemia_four_Folate = {
    "name":"叶酸(Folate)",
    "unit": "ng/ml",
    "stage": ["通用",],
    "size_range": [
        [(0, 3.1),(3.1, 6.58),(6.58, 17.02),(17.02, 20.5),(20.5, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "严重缺乏,可能导致贫血,增加胎儿神经管畸形风险。立即就医,在医生指导下补充大剂量叶酸。",
        "叶酸不足。增加富含叶酸食物(绿叶蔬菜),备孕及孕早期女性遵医嘱补充。" ,
        "叶酸水平正常,保持健康饮食。",
        "通常无害,但可能掩盖VitB12缺乏。咨询医生是否补充过量,评估VitB12水平。",
        "通常无害,但可能掩盖VitB12缺乏。咨询医生是否补充过量,评估VitB12水平。",
    ],]
}
anemia_four_VitB12 = {
    "name":"维生素B12(VitB12)",
    "unit": "pg/ml",
    "stage": ["通用",],
    "size_range": [
        [(0, 187),(187, 326.2),(326.2, 743.8),(743.8, 883),(883, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "可能导致巨幼细胞贫血和神经系统损伤。立即就医,在医生指导下补充VitB12。",
        "VitB12水平不足。增加动物性食品摄入(肉、蛋、奶),素食者需考虑补充剂。",
        "VitB12水平正常,保持均衡饮食。",
        "较少见,可能与肝肾疾病或血液病有关。咨询医生,进行相关检查。",
        "较少见,可能与肝肾疾病或血液病有关。咨询医生,进行相关检查。",
    ],]
}
anemia_four_TRF = {
    "name":"转铁蛋白(TRF)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 2),(2, 2.32),(2.32, 3.28),(3.28, 3.6),(3.6, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "可能与营养不良、肝脏合成功能下降或炎症有关。需就医评估肝功能和营养状况。",
        "可能与营养不良、肝脏合成功能下降或炎症有关。需就医评估肝功能和营养状况。",
        "铁转运蛋白水平正常,保持健康饮食。",
        "最常见于缺铁性贫血(机体试图代偿性增加铁转运)。结合铁蛋白(Fer)结果进行评估,咨询医生。",
        "最常见于缺铁性贫血(机体试图代偿性增加铁转运)。结合铁蛋白(Fer)结果进行评估,咨询医生。",
    ],]
}
# 贫血四项指标 gather列表（核心需求）
anemia_four_gather = [
    anemia_four_Fer,
    anemia_four_Folate,
    anemia_four_VitB12,
    anemia_four_TRF
]

# =============================================
# 检测项目：肝功五项(liver_function)
# 检测编号：18
# 指标数量：16
# =============================================
liver_function_ALB = {
    "name":"白蛋白(ALB)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 40),(40, 43),(43, 52),(52, 55),(55, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "可能与严重肝病、肾病、重度营养不良有关。必须就医查明原因,针对原发病治疗。",
        "提示肝脏合成功能下降或蛋白质摄入不足。增加优质蛋白摄入(蛋、奶、鱼),咨询医生。",
        "肝脏合成功能及营养状况良好,保持均衡饮食。",
        "主要见于血液浓缩(如严重脱水)。确保每日饮水充足,若持续偏高,请咨询医生。",
        "主要见于血液浓缩(如严重脱水)。确保每日饮水充足,若持续偏高,请咨询医生。",
    ],]
}
liver_function_ALT = {
    "name":"丙氨酸氨基转移酶(ALT)",
    "unit": "U/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 5),(5, 11),(11, 29),(29, 35),(35, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "无特殊临床意义,保持健康生活方式。",
        "无特殊临床意义,保持健康生活方式。",
        "肝细胞功能正常。继续保持良好生活习惯,避免饮酒、熬夜。",
        "轻度肝损伤信号。注意休息,忌酒,清淡饮食,定期复查。",
        "提示较严重的肝细胞损伤。必须立即就医,进行详细检查,明确病因。",
    ],]
}
liver_function_AST = {
    "name":"天门冬氨酸氨基转移酶(AST)",
    "unit": "U/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 8),(8, 14.4),(14.4, 33.6),(33.6, 40),(40, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "无特殊临床意义,保持健康生活方式。",
        "无特殊临床意义,保持健康生活方式。",
        "酶活性正常,继续保持良好生活习惯。",
        "提示细胞损伤,可见于肝脏、心肌、骨骼肌。结合ALT结果分析,避免剧烈运动后检查,咨询医生。",
        "提示较严重的细胞损伤。必须立即就医,明确损伤来源(肝脏、心脏等)。",
    ],]
}
liver_function_AST_ALT = {
    "name":"天门冬氨酸/丙氨酸氨基转移酶比值(AST/ALT)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        [(0, 0.7),(0.7, 1.02),(1.02, 1.98),(1.98, 2.3),(2.3, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "当转氨酶升高时,比值<1常提示病毒性肝炎等肝实质损伤。需由医生结合其他指标综合判断。",
        "当转氨酶升高时,比值<1常提示病毒性肝炎等肝实质损伤。需由医生结合其他指标综合判断。",
        "比值在正常范围,无需特殊处理。",
        "当转氨酶升高时,比值>2常提示酒精性肝病或心肌损伤。需由医生结合病史和其他指标综合判断。",
        "当转氨酶升高时,比值>2常提示酒精性肝病或心肌损伤。需由医生结合病史和其他指标综合判断。",  
    ],]
}
liver_function_T_BiL = {
    "name":"总胆红素(T-BiL)",
    "unit": "μmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 5.1),(5.1, 7.88),(7.88, 16.22),(16.22, 19),(19, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "无临床意义,无需处理。",
        "无临床意义,无需处理。",
        "胆红素代谢正常,保持健康饮食。",
        "提示黄疸,可能与肝脏疾病、胆道梗阻或溶血有关。必须就医查明原因,进一步区分直接/间接胆红素。",
        "提示黄疸,可能与肝脏疾病、胆道梗阻或溶血有关。必须就医查明原因,进一步区分直接/间接胆红素。",
    ],]
}
liver_function_D_BiL = {
    "name":"直接胆红素(D-BiL)",
    "unit": "μmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 1.7),(1.7, 2.72),(2.72, 5.78),(5.78, 6.8),(6.8, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "偏低一般不提示疾病,多为正常波动或检测因素。",
        "偏低一般不提示疾病,多为正常波动或检测因素。",
        "肝功能与胆道排泄功能相对正常,没有明显阻塞或胆汁淤积迹象。",
        "提示梗阻性或肝细胞性黄疸,表明肝脏处理后的胆红素排泄不畅。必须就医,检查肝胆系统。",
        "提示梗阻性或肝细胞性黄疸,表明肝脏处理后的胆红素排泄不畅。必须就医,检查肝胆系统。",
    ],]
}
liver_function_I_BiL = {
    "name":"间接胆红素(I-BiL)",
    "unit": "μmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 0),(0, 2.72),(2.72, 10.88),(10.88, 13.6),(13.6, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "偏低一般不提示疾病,多为正常波动或检测因素。",
        "偏低一般不提示疾病,多为正常波动或检测因素。",
        "表明红细胞更新、肝功能的摄取与结合代谢都无明显异常。",
        "提示溶血性或肝细胞性黄疸,表明肝脏处理前的胆红素过多。必须就医,排查溶血性疾病或肝细胞损伤。",
        "提示溶血性或肝细胞性黄疸,表明肝脏处理前的胆红素过多。必须就医,排查溶血性疾病或肝细胞损伤。",
    ],]
}
liver_function_GGT = {
    "name":"谷氨酰转肽酶(GGT)",
    "unit": "U/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 7),(7, 14.6),(14.6, 37.4),(37.4, 45),(45, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "偏低一般不提示疾病,多为正常波动或检测因素。",
        "偏低一般不提示疾病,多为正常波动或检测因素。",
        "肝脏代谢与胆道系统相对健康,没有酶诱导或胆汁淤积。",
        "对酒精性肝损伤和胆道疾病非常敏感。严格戒酒,清淡饮食,并就医排查肝胆疾病。",
        "对酒精性肝损伤和胆道疾病非常敏感。严格戒酒,清淡饮食,并就医排查肝胆疾病。",
    ],]
}
liver_function_TP = {
    "name":"总蛋白(TP)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 65),(65, 69),(69, 81),(81, 85),(85, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "可能与营养不良、肝功能严重受损或肾病综合征有关。需就医评估肝肾功能和营养状况。",
        "可能与营养不良、肝功能严重受损或肾病综合征有关。需就医评估肝肾功能和营养状况。",
        "蛋白质水平正常,保持均衡饮食。",
        "可见于脱水或某些球蛋白异常增多的疾病。确保饮水充足,咨询医生排查潜在疾病。",
        "可见于脱水或某些球蛋白异常增多的疾病。确保饮水充足,咨询医生排查潜在疾病。",
    ],]
}
liver_function_GLO = {
    "name":"球蛋白(GLO)",
    "unit": "g/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 20),(20, 24),(24, 36),(36, 40),(40, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "可能与免疫功能低下有关,请咨询医生。",
        "可能与免疫功能低下有关,请咨询医生。",
        "免疫球蛋白水平在正常范围,保持健康。",
        "常见于慢性感染、慢性肝病、自身免疫性疾病等。必须就医进行详细检查。",
        "常见于慢性感染、慢性肝病、自身免疫性疾病等。必须就医进行详细检查。",
    ],]
}
liver_function_A_G = {
    "name":"白蛋白/球蛋白比值(A/G)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        [(0, 1.25),(1.25, 1.28),(1.28, 1.37),(1.37, 1.4),(1.4, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "称为A/G倒置,是临床上的重要信号,常见于肝功能严重受损或产生大量球蛋白的疾病。必须立即就医,进行全面评估。",
        "称为A/G倒置,是临床上的重要信号,常见于肝功能严重受损或产生大量球蛋白的疾病。必须立即就医,进行全面评估。",
        "比例正常,无需处理。",
        "临床意义相对较小,需结合其他指标判断。",
        "临床意义相对较小,需结合其他指标判断。",
    ],]
}
liver_function_ALP = {
    "name":"碱性磷酸酶(ALP)",
    "unit": "U/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 35),(35, 55),(55, 115),(115, 135),(135, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "临床意义不大,或见于严重营养不良,请咨询医生。",
        "临床意义不大,或见于严重营养不良,请咨询医生。",
        "酶活性正常,保持健康。",
        "生理性增高见于孕妇和儿童；病理性增高常见于肝胆疾病和骨骼疾病。需由医生结合年龄、生理状态及其他检查判断。",
        "生理性增高见于孕妇和儿童；病理性增高常见于肝胆疾病和骨骼疾病。需由医生结合年龄、生理状态及其他检查判断。",
    ],]
}
liver_function_ChE = {
    "name":"胆碱酯酶(ChE)",
    "unit": "U/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 3900),(3900, 5280),(5280, 9420),(9420, 10800),(10800, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "是肝实质细胞严重损害的重要指标,也见于有机磷农药中毒。必须立即就医,评估肝功能或有无中毒史。",
        "是肝实质细胞严重损害的重要指标,也见于有机磷农药中毒。必须立即就医,评估肝功能或有无中毒史。",
        "酶活性正常,无需处理。",
        "较少见,可见于肾病综合征等,请咨询医生。",
        "较少见,可见于肾病综合征等,请咨询医生。",
    ],]
}
liver_function_AFU = {
    "name":"α-L-岩藻糖苷酶(AFU)",
    "unit": "U/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 0),(0, 8),(8, 32),(32, 40),(40, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "临床意义不大,或见于严重营养不良,请咨询医生。",
        "临床意义不大,或见于严重营养不良,请咨询医生。",
        "风险较低,无需处理。",
        "是原发性肝癌的辅助诊断指标之一。需结合甲胎蛋白(AFP)等其他检查,并咨询医生。",
        "是原发性肝癌的辅助诊断指标之一。需结合甲胎蛋白(AFP)等其他检查,并咨询医生。",
    ],]
}
liver_function_ADA = {
    "name":"腺苷脱氨酶(ADA)",
    "unit": "U/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 4),(4, 8),(8, 20),(20, 24),(24, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "临床意义不大,或见于严重营养不良,请咨询医生。",
        "临床意义不大,或见于严重营养不良,请咨询医生。",
        "酶活性正常,无需处理。",
        "显著增高常见于结核性胸腹水,也可见于肝病、白血病等。需由医生结合临床症状和其他检查判断。",
        "显著增高常见于结核性胸腹水,也可见于肝病、白血病等。需由医生结合临床症状和其他检查判断。",
    ],]
}
liver_function_TBA = {
    "name":"总胆汁酸(TBA)",
    "unit": "μmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 0),(0, 2),(2, 8),(8, 10),(10, 1000000)],   
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis": [[
        "临床意义不大,或见于严重营养不良,请咨询医生。",
        "临床意义不大,或见于严重营养不良,请咨询医生。",
        "肝胆功能良好,无需处理。",
        "反映肝实质损伤和胆汁淤积的敏感指标。孕期增高需警惕妊娠期肝内胆汁淤积症。必须就医评估肝胆功能。",
        "反映肝实质损伤和胆汁淤积的敏感指标。孕期增高需警惕妊娠期肝内胆汁淤积症。必须就医评估肝胆功能。",
    ],]
}
# 肝功能指标汇总列表
liver_function_gather = [
    liver_function_ALB,
    liver_function_ALT,
    liver_function_AST,
    liver_function_AST_ALT,
    liver_function_T_BiL,
    liver_function_D_BiL,
    liver_function_I_BiL,
    liver_function_GGT,
    liver_function_TP,
    liver_function_GLO,
    liver_function_A_G,
    liver_function_ALP,
    liver_function_ChE,
    liver_function_AFU,
    liver_function_ADA,
    liver_function_TBA
]
# =============================================
# 检测项目：甲功 (thyroid_function)
# 检测编号：19
# 指标数量：8
# =============================================
thyroid_function_TSH = {
    "name": "促甲状腺激素(TSH)",
    "unit": "mIU/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 0.35), (0.35, 1.3), (1.3, 4.15), (4.15, 5.1), (5.1, 1000000)],
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"],
    ],
    "analysis": [[
        "提示甲亢可能性大。立即就医内分泌科,进行评估和治疗。",
        "提示亚临床甲亢。咨询医生,密切监测,避免含碘高的食物。",
        "甲状腺功能调节正常。定期体检,保持健康生活。",
        "提示亚临床甲减。咨询医生,定期复查甲功。",
        "提示甲减可能性大。立即就医内分泌科,明确病因并开始治疗。",
    ],]
}

thyroid_function_TT3 = {
    "name": "总三碘甲状腺原氨酸(TT3)",
    "unit": "nmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 0.89), (0.89, 1.21), (1.21, 2.17), (2.17, 2.49), (2.49, 1000000)],
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"],
    ],
    "analysis": [[
        "可能提示甲减。",
        "可能提示甲减。",
        "水平正常。",
        "可能提示甲亢,特别是T3型甲亢。均需结合TSH和FT3/FT4综合判断,咨询医生。",
        "可能提示甲亢,特别是T3型甲亢。均需结合TSH和FT3/FT4综合判断,咨询医生。",
    ],]
}

thyroid_function_TT4 = {
    "name": "总甲状腺素(TT4)",
    "unit": "nmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 64.35), (64.35, 88.80), (88.80, 162.16), (162.16, 186.62), (186.62, 1000000)],
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"],
    ],
    "analysis": [[
        "可能提示甲减。",
        "可能提示甲减。",
        "水平正常。",
        "可能提示甲亢。均需结合TSH和FT3/FT4综合判断,咨询医生。",
        "可能提示甲亢。均需结合TSH和FT3/FT4综合判断,咨询医生。",
    ],]
}

thyroid_function_FT3 = {
    "name": "游离三碘甲状腺原氨酸(FT3)",
    "unit": "pmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 2.76), (2.76, 3.50), (3.50, 5.71), (5.71, 6.45), (6.45, 1000000)],
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"],
    ],
    "analysis": [[
        "提示甲减。",
        "提示甲减。",
        "水平正常。",
        "提示甲亢。均需结合TSH综合判断,FT3是反映甲状腺功能的活性指标。",
        "提示甲亢。均需结合TSH综合判断,FT3是反映甲状腺功能的活性指标。",
    ],]
}

thyroid_function_FT4 = {
    "name": "游离甲状腺素(FT4)",
    "unit": "pmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 11.20), (11.20, 13.72), (13.72, 21.29), (21.29, 23.81), (23.81, 1000000)],
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"],
    ],
    "analysis": [[
        "提示甲减。",
        "提示甲减。",
        "水平正常。",
        "提示甲亢。均需结合TSH综合判断,FT4是反映甲状腺功能的敏感指标。",
        "提示甲亢。均需结合TSH综合判断,FT4是反映甲状腺功能的敏感指标。",
    ],]
}

thyroid_function_TPOAb = {
    "name": "甲状腺过氧化物酶抗体(TPOAb)",
    "unit": "IU/mL",
    "stage": ["通用",],
    "size_range": [
        [(0, 0), (0, 1.12), (1.12, 4.49), (4.49, 5.61), (5.61, 1000000)],
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"],
    ],
    "analysis": [[
        "表示没有明显的甲状腺自身免疫反应。",
        "表示没有明显的甲状腺自身免疫反应。",
        "自身免疫性甲状腺疾病风险低,无需处理。",
        "提示存在自身免疫性甲状腺疾病(如桥本氏甲状腺炎)的风险或已患病。必须咨询内分泌科医生,结合其他甲功指标综合判断。",
        "提示存在自身免疫性甲状腺疾病(如桥本氏甲状腺炎)的风险或已患病。必须咨询内分泌科医生,结合其他甲功指标综合判断。",
    ],]
}

thyroid_function_TGAb = {
    "name": "甲状腺球蛋白抗体(TGAb)",
    "unit": "IU/mL",
    "stage": ["通用",],
    "size_range": [
        [(0, 0), (0, 23), (23, 92), (92, 115.0), (115.0, 1000000)],
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"],
    ],
    "analysis": [[
        "表示甲状腺稳定,不存在免疫攻击。",
        "表示甲状腺稳定,不存在免疫攻击。",
        "风险较低,无需处理。",
        "提示存在自身免疫性甲状腺疾病(如桥本氏甲状腺炎)的风险或已患病。需咨询医生。",
        "提示存在自身免疫性甲状腺疾病(如桥本氏甲状腺炎)的风险或已患病。需咨询医生。",
    ],]
}

thyroid_function_TSHRAb = {
    "name": "促甲状腺激素受体抗体(TSHRAb)",
    "unit": "IU/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 0.00), (0.00, 0.35), (0.35, 1.40), (1.40, 1.75), (1.75, 1000000)],
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"],
    ],
    "analysis": [[
        "没有导致甲亢的致病抗体",
        "没有导致甲亢的致病抗体",
        "风险较低,无需处理。",
        "是Graves病(导致甲亢的主要原因)的特异性指标。必须咨询内分泌科医生,是诊断Graves病的重要依据。",
        "是Graves病(导致甲亢的主要原因)的特异性指标。必须咨询内分泌科医生,是诊断Graves病的重要依据。",
    ],]
}

# 甲状腺功能指标汇总列表
thyroid_function_gather = [
    thyroid_function_TSH,
    thyroid_function_TT3,
    thyroid_function_TT4,
    thyroid_function_FT3,
    thyroid_function_FT4,
    thyroid_function_TPOAb,
    thyroid_function_TGAb,
    thyroid_function_TSHRAb
]
# =============================================
# 检测项目：孕前基础健康评估报告 (preconception_health)
# 检测编号：20
# 指标数量：1
# =============================================

preconception_health_25_OH_VD = {
    "name": "25-羟维生素D(25-OH-VD)",
    "unit": "ng/mL",
    "stage": ["通用",],
    "size_range": [
        [(0, 30), (30, 1000000)],
    ],
    "size_category": [
        ["过小", "正常"],
    ],
    "analysis": [[
        "维生素D水平不充足。建议多晒太阳,适当补充维生素D制剂,多食用富含维生素D的食物(如深海鱼类、蛋黄等)。",
        "维生素D水平充足,维持现有良好习惯。保持适量户外活动和均衡饮食。",
    ],]
}

# 孕前基础健康评估报告 gather列表
preconception_health_gather = [
    preconception_health_25_OH_VD
]

# =============================================
# 检测项目：尿常规 (urine_routine)
# 检测编号：21
# 指标数量：6
# =============================================
urine_routine_PRO = {
    "name": "尿蛋白(PRO)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["-", "+", "++", "+++", "++++"],
    ],
    "size_category": [
        ["正常", "轻度异常", "异常", "异常", "异常"],
    ],
    "analysis": [[
        "肾脏的肾小球滤过屏障和肾小管重吸收功能无明显异常。",
        "肾脏的肾小球滤过屏障和肾小管重吸收功能轻微异常。",
        "明显异常，提示肾脏损伤。",
        "明显异常，提示肾脏损伤。",
        "明显异常，提示肾脏损伤。",
    ],]
}
urine_routine_GLU = {
    "name": "尿糖(GLU)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["-", "+", "++", "+++", "++++"],
    ],
    "size_category": [
        ["正常", "异常", "异常", "异常", "异常"],
    ],
    "analysis": [[
        "暂未提示糖尿病，是糖代谢正常的初步信号。",
        "提示尿中含糖。",
        "提示尿中含糖。",
        "提示尿中含糖。",
        "提示尿中含糖。",
    ],]
}
urine_routine_KET = {
    "name": "酮体(KET)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["-", "+", "++", "+++"],
    ],
    "size_category": [
        ["正常", "异常", "异常", "异常"],
    ],
    "analysis": [[
        "暂排除糖尿病酮症，代谢状态稳定。",
        "常见于糖尿病酮症、长期饥饿、严重呕吐。",
        "常见于糖尿病酮症、长期饥饿、严重呕吐。",
        "常见于糖尿病酮症、长期饥饿、严重呕吐。",
    ],]
}
urine_routine_BIL = {
    "name": "尿胆红素(BIL)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["-", "+", "++", ],
    ],
    "size_category": [
        ["正常", "异常", "异常", ],
    ],
    "analysis": [[
        "肝脏处理胆红素的功能正常。",
        "可能肝胆疾病（如肝炎、胆道梗阻）。",
        "可能肝胆疾病（如肝炎、胆道梗阻）。",
    ],]
}
urine_routine_URO = {
    "name": "尿胆原(URO)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["-", "+", "++",],
    ],
    "size_category": [
        ["正常", "可能异常", "可能异常"],
    ],
    "analysis": [[
        "肝脏对胆红素的转化、肠道对胆素原的吸收及肾脏的排泄均处于正常状态。",
        "可能肝胆疾病（如肝炎、胆道梗阻）。",
        "可能肝胆疾病（如肝炎、胆道梗阻）。",
    ],]
}
urine_routine_NIT = {
    "name": "亚硝酸盐(NIT)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["-", "+",],
    ],
    "size_category": [
        ["正常", "轻微异常",],
    ],
    "analysis": [[
        "泌尿系统（尿道、膀胱、肾盂等）无致病性革兰氏阴性菌（如大肠杆菌、变形杆菌等）的大量繁殖。",
        "细菌感染，可能大肠埃希菌等革兰阴性菌感染。"
    ],]
}

# 尿常规 gather列表
urine_routine_gather = [
    urine_routine_PRO,
    urine_routine_GLU,
    urine_routine_KET,
    urine_routine_BIL,
    urine_routine_URO,
    urine_routine_NIT
]

# =============================================
# 检测项目：核医学 (nuclear_medicine)
# 检测编号：22
# 指标数量：1
# =============================================
nuclear_medicine_CA199 = {
    "name": "糖类抗原19-9(CA199)",
    "unit": "U/ml",
    "stage": ["通用",],
    "size_range": [
        [(0, 37), (37, 1000000)],
    ],
    "size_category": [
        ["正常", "过大"],
    ],
    "analysis": [[
        "风险较低,无需处理。",
        "是胰腺癌、胆管癌等消化道肿瘤的辅助诊断指标,也可见于某些良性疾病。需结合影像学等其他检查,并咨询医生。"
    ],]
}

# 核医学 gather列表
nuclear_medicine_gather = [
    nuclear_medicine_CA199
]

# =============================================
# 检测项目：结核感染t细胞检测 (tb_tcell)
# 检测编号：23
# 指标数量：4
# =============================================
tb_tcell_IFN_N = {
    "name": "IFN-（N）",
    "unit": "pg/ml",
    "stage": ["通用",],
    "size_range": [
        [],
    ],
    "size_category": [
        [],
    ],
    "analysis": [[
        "",
    ],]
}

tb_tcell_overall = {
    "name": "结核感染T细胞检测",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ['阴性', '阳性'],
    ],
    "size_category": [
        ['阴性', '阳性'],
    ],
    "analysis": [[
        "感染风险低,保持正常生活方式。",
        "可能提示结核感染倾向,建议结合临床进一步检查。"
    ],]
}

tb_tcell_IFN_Y_T = {
    "name": "IFN-Y（T）",
    "unit": "pg/ml",
    "stage": ["通用",],
    "size_range": [
        [],
    ],
    "size_category": [
        [],
    ],
    "analysis": [[
        "",
    ],]
}

tb_tcell_IFN_V_T_N = {
    "name": "IFN-V（T-N）",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        [(0, 14), (14, 1000000)],
    ],
    "size_category": [
        ["正常", "过大"],
    ],
    "analysis": [[
        "未检测到结核感染相关免疫反应",
        "检测到结核感染相关免疫反应,提示可能存在结核感染"
    ],]
}

# 结核感染t细胞检测 gather列表
tb_tcell_gather = [
    tb_tcell_IFN_N,
    tb_tcell_overall,
    tb_tcell_IFN_Y_T,
    tb_tcell_IFN_V_T_N
]

# =============================================
# 检测项目：rf分型(类风湿因子) (rf_typing)
# 检测编号：24
# 指标数量：3
# =============================================
rf_typing_IgA = {
    "name": "类风湿因子IgA",
    "unit": "RU/ml",
    "stage": ["通用",],
    "size_range": [
        [(0,20),(20,1000000)],
    ],
    "size_category": [
        ["正常","过大"],
    ],
    "analysis":[[
        "风险较低,无需处理。",
        "是类风湿关节炎的辅助诊断指标,也可见于其他自身免疫病或慢性感染。若有关节疼痛等症状,必须就医风湿免疫科。"
    ],]
}
rf_typing_IgG = {
    "name": "类风湿因子IgG",
    "unit": "RU/ml",
    "stage": ["通用",],
    "size_range": [
        [(0,20),(20,1000000)],
    ],
    "size_category": [
        ["正常","过大"],
    ],
    "analysis":[[
        "风险较低,无需处理。",
        "是类风湿关节炎的辅助诊断指标,也可见于其他自身免疫病或慢性感染。若有关节疼痛等症状,必须就医风湿免疫科。"
    ],]
}
rf_typing_IgM = {
    "name": "类风湿因子IgM",
    "unit": "RU/ml",
    "stage": ["通用",],
    "size_range": [
        [(0,20),(20,1000000)],
    ],
    "size_category": [
        ["正常","过大"],
    ],
    "analysis":[[
        "风险较低,无需处理。",
        "是类风湿关节炎的辅助诊断指标,也可见于其他自身免疫病或慢性感染。若有关节疼痛等症状,必须就医风湿免疫科。"
    ],]
}

# rf分型(类风湿因子) gather列表
rf_typing_gather = [
    rf_typing_IgA,
    rf_typing_IgG,
    rf_typing_IgM
]

# =============================================
# 检测项目：血脂 (blood_lipid)
# 检测编号：25
# 指标数量：4
# =============================================
blood_lipid_TC = {
    "name": "总胆固醇(TC)",
    "unit": "mmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0,5.2),(5.2,1000000)],
    ],
    "size_category": [
        ["正常","过大"],
    ],
    "analysis":[[
        "血脂水平理想。",
        "心血管疾病风险显著增加。立即咨询医生。"
    ],]
}
blood_lipid_TG = {
    "name": "甘油三酯(TG)",
    "unit": "mmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0,1.7),(1.7,1000000)],
    ],
    "size_category": [
        ["正常","过大"],
    ],
    "analysis":[[
        "血脂水平理想。",
        "心血管疾病风险及急性胰腺炎风险(当>5.6时)显著增加。立即就医。"
    ],]
}
blood_lipid_LDL_C = {
    "name": "低密度脂蛋白胆固醇(LDL-C)",
    "unit": "mmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0,3.4),(3.4,1000000)],
    ],
    "size_category": [
        ["正常","过大"],
    ],
    "analysis":[[
        "水平理想。",
        "心血管疾病风险显著增高。必须咨询医生。"
    ],]
}
blood_lipid_HDL_C = {
    "name": "高密度脂蛋白胆固醇(HDL-C)",
    "unit": "mmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0,1),(1,1000000)],
    ],
    "size_category": [
        ["过小","正常"],
    ],
    "analysis":[[
        "水平不足,是心血管疾病的独立危险因素。",
        "对心血管有保护作用,保持健康生活方式。"
    ],]
}

# 血脂 gather列表
blood_lipid_gather = [
    blood_lipid_TC,
    blood_lipid_TG,
    blood_lipid_LDL_C,
    blood_lipid_HDL_C
]

# =============================================
# 检测项目：血糖 (blood_glucose)
# 检测编号：26
# 指标数量：3
# =============================================
blood_glucose_FPG = {
    "name": "空腹血糖(FPG)",
    "unit": "mmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0,3.9),(3.9,4.34),(4.34,5.66),(5.66,6.1),(6.1,1000000)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis":[[
        "严重低血糖。立即补充糖分,并尽快就医查明原因。",
        "低血糖倾向。定时进餐,避免长时间空腹,咨询医生。",
        "血糖调节功能良好。保持健康饮食和规律作息。",
        "糖尿病前期(空腹血糖受损)。立即开始生活方式干预：控制饮食,增加运动。",
        "达到糖尿病诊断标准之一。立即就医内分泌科,确诊并开始系统性治疗。"
    ],]
}
blood_glucose_2hPG = {
    "name": "餐后2小时血糖(2hPG)",
    "unit": "mmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0,7.8),(7.8,1000000)],
    ],
    "size_category": [
        ["正常","过大"],
    ],
    "analysis":[[
        "餐后血糖调节能力良好,无需处理。",
        "达到糖尿病诊断标准之一。立即就医内分泌科。"
    ],]
}
blood_glucose_HbA1c = {
    "name": "糖化血红蛋白(HbA1c)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0,4.0),(4.0,4.4),(4.4,5.6),(5.6,6.0),(6.0,1000000)],
    ],
    "size_category": [
        ["过小","偏小","正常","偏大","过大"],
    ],
    "analysis":[[
        "可能与近期频繁低血糖或某些贫血有关。咨询医生,评估低血糖风险。",
        "可能与近期频繁低血糖或某些贫血有关。咨询医生,评估低血糖风险。",
        "近2-3个月平均血糖水平控制良好。保持健康的生活方式。",
        "糖尿病前期信号。是重要的预警信号,应立即开始生活方式干预。",
        "达到糖尿病诊断标准之一。立即就医内分泌科,确认诊断并启动全面管理。"
    ],]
}

# 血糖 gather列表
blood_glucose_gather = [
    blood_glucose_FPG,
    blood_glucose_2hPG,
    blood_glucose_HbA1c
]

# =============================================
# 检测项目：同型半胱氨酸报告 (homocysteine)
# 检测编号：27
# 指标数量：1
# =============================================
homocysteine_HCY = {
    "name": "同型半胱氨酸(HCY)",
    "unit": "μmol/L",
    "stage": ["通用",],
    "size_range": [
        [(0, 0), (0, 3), (3, 12), (12, 15), (15, 1000000)]
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"]
    ],
    "analysis": [[
        "一般不被视为异常,无需处理。",
        "心血管疾病风险处于较低水平。保持富含B族维生素的饮食。",
        "心血管疾病风险处于较低水平。保持富含B族维生素的饮食。",
        "增加心脑血管疾病、血栓及妊娠并发症风险。咨询医生,补充叶酸、维生素B6、维生素B12。",
        "风险显著增高。必须在医生指导下进行干预,补充指定剂量的B族维生素。"
    ],]
}

# 同型半胱氨酸报告 gather列表
homocysteine_gather = [
    homocysteine_HCY
]

# =============================================
# 检测项目：tct
# 检测编号：28
# 指标数量：6
# =============================================
# 占位，直接输出report_data内容
tct_summary = {
    "name": "tct",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["Placeholder"]
    ],
    "size_category": [
        ["Placeholder"],
    ],
    "analysis": [[
        "Placeholder",
    ],]
}

# 该报告包含的所有指标
tct_gather = [
    tct_summary,
]

# tct_NILM = {
#     "name": "未见上皮内病变或恶性细胞(tct-NILM)",
#     "unit": "",
#     "stage": ["通用",],
#     "size_range": [
#         []
#     ],
#     "size_category": [
#         [],
#     ],
#     "analysis": [[
#     ],]
# }
# tct_inflammatory_cell_changes = {
#     "name": "炎症细胞改变(tct-Inflammatory cell changes)",
#     "unit": "",
#     "stage": ["通用",],
#     "size_range": [
#         []
#     ],
#     "size_category": [
#         [],
#     ],
#     "analysis": [[
#     ],]
# }
# tct_ASC_US = {
#     "name": "意义不明的非典型鳞状细胞(ASC-US)",
#     "unit": "",
#     "stage": ["通用",],
#     "size_range": [
#         []
#     ],
#     "size_category": [
#         [],
#     ],
#     "analysis": [[
#     ],]
# }
# tct_LSIL = { 
#     "name": "低度鳞状上皮内病变(LSIL)",
#     "unit": "",
#     "stage": ["通用",],
#     "size_range": [
#         []
#     ],
#     "size_category": [
#         [],
#     ],
#     "analysis": [[
#     ],]
# }
# tct_HSIL = {
#     "name": "高度鳞状上皮内病变(HSIL)",
#     "unit": "",
#     "stage": ["通用",],
#     "size_range": [
#         []
#     ],
#     "size_category": [
#         [],
#     ],
#     "analysis": [[
#     ],]
# }
# tct_squamous_cell_carcinoma = {
#     "name": "鳞状细胞癌/腺细胞癌(squamous_cell_carcinoma)",
#     "unit": "",
#     "stage": ["通用",],
#     "size_range": [
#         []
#     ],
#     "size_category": [
#         [],
#     ],
#     "analysis": [[
#     ],]
# }

# # 该报告包含的所有指标
# # tct_NILM、tct_inflammatory_cell_changes、tct_ASC_US、tct_LSIL、tct_HSIL、tct_squamous_cell_carcinoma
# tct_gather = [
#     tct_NILM, 
#     tct_inflammatory_cell_changes, 
#     tct_ASC_US, 
#     tct_LSIL, 
#     tct_HSIL, 
#     tct_squamous_cell_carcinoma
# ]

# =============================================
# 检测项目：Y-染色体微缺失(y_microdeletion)
# 检测编号：29
# 指标数量：6
# =============================================
y_microdeletion_sY84 = {
    "name": "Y-染色体微缺失(sY84)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["存在", "缺失"]
    ],
    "size_category": [
        ["正常", "异常"],
    ],
    "analysis": [[
        "Y-染色体(sY84)存在。",
        "Y-染色体(sY84)缺失。",
    ],]
}
y_microdeletion_sY86 = {
    "name": "Y-染色体微缺失(sY86)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["存在", "缺失"]
    ],
    "size_category": [
        ["正常", "异常"],
    ],
    "analysis": [[
        "Y-染色体(sY86)存在。",
        "Y-染色体(sY86)缺失。",
    ],]
}
y_microdeletion_sY127 = {
    "name": "Y-染色体微缺失(sY127)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["存在", "缺失"]
    ],
    "size_category": [
        ["正常", "异常"],
    ],
    "analysis": [[
        "Y-染色体(sY127)存在。",
        "Y-染色体(sY127)缺失。",
    ],]
}
y_microdeletion_sY134 = { 
    "name": "Y-染色体微缺失(sY134)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["存在", "缺失"]
    ],
    "size_category": [
        ["正常", "异常"],
    ],
    "analysis": [[
        "Y-染色体(sY134)存在。",
        "Y-染色体(sY134)缺失。",
    ],]
}
y_microdeletion_sY254 = {
    "name": "Y-染色体微缺失(sY254)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["存在", "缺失"]
    ],
    "size_category": [
        ["正常", "异常"],
    ],
    "analysis": [[
        "Y-染色体(sY254)存在。",
        "Y-染色体(sY254)缺失。",
    ],]
}
y_microdeletion_sY255 = {
    "name": "Y-染色体微缺失(sY255)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["存在", "缺失"]
    ],
    "size_category": [
        ["正常", "异常"],
    ],
    "analysis": [[
        "Y-染色体(sY255)存在。",
        "Y-染色体(sY255)缺失。",
    ],]
}

# 该报告包含的所有指标
y_microdeletion_gather = [
    y_microdeletion_sY84, 
    y_microdeletion_sY86, 
    y_microdeletion_sY127, 
    y_microdeletion_sY134, 
    y_microdeletion_sY254, 
    y_microdeletion_sY255
]

# =============================================
# 检测项目：狼疮(lupus)
# 检测编号：30
# 指标数量：3
# =============================================
lupus_LA1 = {
    "name": "狼疮抗凝物初筛试验1(LA1)",
    "unit": "s",
    "stage": ["通用",],
    "size_range": [
        [(0, 27), (27, 30), (30, 39), (39, 42), (42, 1000000)]
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"]
    ],
    "analysis": [[
        "一般不被视为异常,无需处理。",
        "一般不被视为异常,无需处理。",
        "心血管疾病风险较低,维持正常生活方式即可。",
        "可能增加凝血异常风险,咨询医生进一步评估。",
        "风险显著增高,需在医生指导下进一步检查狼疮抗凝物相关项目。"
    ],]
}
lupus_LA2 = {
    "name": "狼疮抗凝物确定试验(LA2)",
    "unit": "s",
    "stage": ["通用",],
    "size_range": [
        [(0, 24), (24, 25.4), (25.4, 29.6), (29.6, 31), (31, 1000000)]
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"]
    ],
    "analysis": [[
        "一般不被视为异常,无需处理。",
        "一般不被视为异常,无需处理。",
        "风险较低,可继续保持健康的生活方式。",
        "可能提示轻度凝血异常,建议进一步咨询医生。",
        "风险显著增高,应在医生指导下进行针对性评估及随访。"
    ],]
}
lupus_LA1_LA2 = {
    "name": "狼疮初筛/狼疮确定(LA1/LA2)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        [(0, 0.8), (0.8, 0.88), (0.88, 1.12), (1.12, 1.2), (1.2, 1000000)]
    ],
    "size_category": [
        ["过小", "偏小", "正常", "偏大", "过大"]
    ],
    "analysis": [[
        "一般不被视为异常,无需处理。",
        "一般不被视为异常,无需处理。",
        "风险较低,维持健康习惯即可。",
        "可能提示凝血异常风险上升,建议咨询医生进行进一步检查。",
        "风险显著增高,必须在医生指导下进行相关干预及评估。"
    ],]
}

# 该报告包含的所有指标
# lupus_LA1、lupus_LA2、lupus_LA1_LA2
lupus_gather = [lupus_LA1, lupus_LA2, lupus_LA1_LA2]

# =============================================
# 检测项目：白带常规(leukorrhea_routine)
# 检测编号：31
# 指标数量：13
# =============================================
leukorrhea_routine_Cleanliness = {
    "name": "阴道清洁度(Cleanliness)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["I", "II", "III", "IV"],
    ],
    "size_category": [
        ["正常", "正常", "轻微异常", "异常"],
    ],
    "analysis": [[
        "菌群环境基本健康。",
        "菌群环境基本健康。",
        "提示可能存在轻度炎症或菌群失衡。",
        "提示存在较严重的阴道炎症。",
    ],]
}
leukorrhea_routine_WBC = {
    "name": "白细胞(WBC)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["+", "++", "+++",]
    ],
    "size_category": [
        ["正常", "异常", "异常"],
    ],
    "analysis": [[
        "正常无炎症。",
        "可能出现炎症（细菌、霉菌、滴虫）。",
        "可能出现炎症（细菌、霉菌、滴虫）。",
    ],]
}
leukorrhea_routine_RBC = {
    "name": "红细胞(RBC)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["-", "+", ]
    ],
    "size_category": [
        ["正常", "异常"],
    ],
    "analysis": [[
        "阴道黏膜无破损、出血。",
        "可能存在阴道炎充血破溃、宫颈出血等。",
    ],]
}
leukorrhea_routine_TV = {
    "name": "滴虫(TV)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["阴性", "阳性"]
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "可以排除滴虫性阴道炎。",
        "患有滴虫性阴道炎。",
    ],]
}
leukorrhea_routine_FV = {
    "name": "霉菌(FV)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["阴性", "阳性"]
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "可以排除霉菌性阴道炎。",
        "患有霉菌性阴道炎。",
    ],]
}
leukorrhea_routine_BV = {
    "name": "细菌性阴道病(BV)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["阴性", "阳性"]
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "未患有细菌性阴道病。",
        "存在细菌性阴道病。",
    ],]
}
leukorrhea_routine_pH = {
    "name": "酸碱度(pH)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        [(0, 3.8), (3.8, 4.5), (4.5, 14)]
    ],
    "size_category": [
        [ "偏碱", "正常", "偏酸"]
    ],
    "analysis": [[
        "多见于细菌性阴道病（BV）、滴虫性阴道炎、性生活后、月经前后。",
        "酸碱度指标较为健康。",
        "可能与过度清洁、冲洗有关。",
    ],]
}
leukorrhea_routine_Clue_Cells = {
    "name": "线索细胞(Clue Cells)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["阴性", "阳性"]
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "无细菌性阴道病的特异性表现。",
        "存在细菌性阴道病。",
    ],]
}
leukorrhea_routine_H2O2 = {
    "name": "过氧化氢(H2O2)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["阴性", "阳性"]
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "代表乳酸杆菌正常，阴道抵抗力较好。",
        "代表乳酸杆菌减少或功能下降。",
    ],]
}
leukorrhea_routine_GUS = {
    "name": "β-葡萄糖醛酸酶(GUS)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["阴性", "阳性"]
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "排除了革兰氏阴性菌导致的炎症。",
        "较大概率出现滴虫感染。",
    ],]
}
leukorrhea_routine_SNA = {
    "name": "唾液酸苷酶(SNA)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["阴性", "阳性"]
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "确认无厌氧菌过度增殖。",
        "可能存在细菌性阴道病。",
    ],]
}
leukorrhea_routine_NAG = {
    "name": "乙酰氨基葡萄糖苷酶(NAG)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["阴性", "阳性"]
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "无霉菌,滴虫感染导致的酶升高,也无阴道黏膜损伤。",
        "可能存在霉菌性阴道炎。",
    ],]
}
leukorrhea_routine_LE = {
    "name": "白细胞酯酶(LE)",
    "unit": "",
    "stage": ["通用",],
    "size_range": [
        ["阴性", "阳性"]
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "进一步确认阴道内无活动性炎症。",
        "可能存在炎症。",
    ],]
}

# 白带常规指标汇总列表
leukorrhea_routine_gather = [
    leukorrhea_routine_Cleanliness,
    leukorrhea_routine_WBC,
    leukorrhea_routine_RBC,
    leukorrhea_routine_TV,
    leukorrhea_routine_FV,
    leukorrhea_routine_BV,
    leukorrhea_routine_pH,
    leukorrhea_routine_Clue_Cells,
    leukorrhea_routine_H2O2,
    leukorrhea_routine_GUS,
    leukorrhea_routine_SNA,
    leukorrhea_routine_NAG,
    leukorrhea_routine_LE
]
# =============================================
# 检测项目：肿瘤标记物(tumor_marker)
# 检测编号：32
# 指标数量：3
# =============================================
tumor_marker_CA125 = {
    "name": "糖类抗原125(CA125)",
    "unit": "U/mL",
    "stage": ["通用",],
    "size_range": [
        [(0, 35), (35, 100), (100, 1000000)]
    ],
    "size_category": [
        ["正常", "轻微升高", "明显升高"],
    ],
    "analysis": [[
        "暂未出现与卵巢癌等上皮性妇科肿瘤相关的典型异常信号。",
        "常见于良性疾病：子宫内膜异位症、盆腔炎、卵巢囊肿、月经期、怀孕早期等。",
        "需要警惕卵巢癌等恶性肿瘤，应进一步做影像学检查（如盆腔超声、CT、MRI）。"
    ],]
}
tumor_marker_AFP = {
    "name": "甲胎蛋白(AFP)",
    "unit": "ng/mL",
    "stage": ["通用",],
    "size_range": [
        [(0, 20), (20, 400), (400, 1000000)]
    ],
    "size_category": [
        ["正常", "轻微升高", "明显升高"],
    ],
    "analysis": [[
        "未发现原发性肝癌的典型异常信号。",
        "常见于慢性肝炎、肝硬化、脂肪肝活动期、怀孕等。",
        "高度提示肝癌可能，需尽快做肝脏增强 CT 或 MRI。"
    ],]
}
tumor_marker_CEA = {
    "name": "癌胚抗原(CEA)",
    "unit": "ng/mL",
    "stage": ["通用",],
    "size_range": [
        [(0, 5), (5, 10), (10, 1000000)]
    ],
    "size_category": [
        ["正常", "轻微升高", "明显升高"],
    ],
    "analysis": [[
        "暂未出现结直肠癌等多种消化道、呼吸道肿瘤的广谱异常信号，也排除了因吸烟、慢性炎症等导致的显著升高。",
        "常见于吸烟、结肠炎、胃炎、肺炎、胰腺炎、肝病等。",
        "需警惕消化道肿瘤，建议做胃肠镜、胸部 CT 等检查。"
    ],]
}

# 该报告包含的所有指标
# tumor_marker_CA125、tumor_marker_AFP、tumor_marker_CEA
tumor_marker_gather = [
    tumor_marker_CA125, 
    tumor_marker_AFP, 
    tumor_marker_CEA
]
# =============================================
# 检测项目：淋球菌(neisseria_gonorrhoeae_culture)
# 检测编号：33
# 指标数量：1
# =============================================
# 暂无
neisseria_gonorrhoeae_culture_gonorrhea = {
    "name": "淋球菌培养",
    "unit": "",
    "stage": ["通用"],
    "size_range": [
        ["阴性", "阳性"]
    ],
    "size_category": [
        ["阴性", "阳性"],
    ],
    "analysis": [[
        "未感染淋病。",
        "感染了淋病，需要进行抗生素治疗。",
    ],]
}

# 该报告包含的所有指标
# 
neisseria_gonorrhoeae_culture_gather = [
    neisseria_gonorrhoeae_culture_gonorrhea,
]

# =============================================
# 检测项目：白带膜电位(membrane_potential)
# 检测编号：34
# 指标数量：1
# =============================================
membrane_potential_MMP = {
    "name": "精子线粒体膜电位(MMP)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0, 20), (20, 40),(40, 100) ]
    ],
    "size_category": [
        ["异常", "偏低", "正常",],
    ],
    "analysis": [[
        "线粒体功能明显受损，常见于弱精症、氧化应激升高、长期熬夜、吸烟、酗酒高温暴露、精索静脉曲张或精子能量代谢障碍等。",
        "部分精子线粒体功能下降，可能影响活力。",
        "精子线粒体功能良好，能量供应充足，有利于前向运动和受精。",
    ],]
}

# 该报告包含的所有指标
# 
membrane_potential_gather = [
    membrane_potential_MMP,
]

# =============================================
# 检测项目：DNA碎片化指数 (dna_fragmentation_index)
# 检测编号：35
# 指标数量：1
# =============================================

dna_fragmentation_index_DFI = {
    "name": "DNA碎片化指数(DFI)",
    "unit": "%",
    "stage": ["通用",],
    "size_range": [
        [(0,15),(15,25),(25,30),(30,100)],
    ],
    "size_category": [
        ["正常","轻度异常","中度异常","重度异常"],
    ],
    "analysis":[[
        "说明精子DNA完整性良好,遗传物质稳定，受精成功率高。",
        "DNA完整性一般,自然受孕率下降。",
        "DNA完整性较差，自然受孕难度显著增加。",
        "DNA完整性差，自然受孕率极低，需排查病因并干预。",
    ],]
}
dna_fragmentation_index_gather = [dna_fragmentation_index_DFI]


indicator_gather_list = {
    "sex_hormone": sex_hormone_gather,
    "amh": amh_gather,
    "sperm_status": sperm_status_gather,
    "bUltrasound_Chinese": bUltrasound_Chinese_gather,
    "bUltrasound_Thailand": bUltrasound_Thailand_gather,
    "immuno_five": immuno_five_gather,
    "coag_function": coag_function_gather,
    "renal_function": renal_function_gather,
    "blood_type": blood_type_gather,
    "blood_routine": blood_routine_gather,
    "ct_dna": ct_dna_gather,
    "infectious_disease": infectious_disease_gather,
    "torch": torch_gather,
    "mycoplasma": mycoplasma_gather,
    "hcg_pregnancy": hcg_pregnancy_gather,
    "thalassemia": thalassemia_gather,
    "anemia_four": anemia_four_gather,
    "liver_function": liver_function_gather,
    "thyroid_function": thyroid_function_gather,
    "preconception_health": preconception_health_gather,
    "urine_routine": urine_routine_gather,
    "nuclear_medicine": nuclear_medicine_gather,
    "tb_tcell": tb_tcell_gather,
    "rf_typing": rf_typing_gather,
    "blood_lipid": blood_lipid_gather,
    "blood_glucose": blood_glucose_gather,
    "homocysteine": homocysteine_gather,
    "tct": tct_gather,
    "y_microdeletion": y_microdeletion_gather,
    "lupus": lupus_gather,
    "leukorrhea_routine": leukorrhea_routine_gather,
    "tumor_marker": tumor_marker_gather,
    "neisseria_gonorrhoeae_culture": neisseria_gonorrhoeae_culture_gather,
    "membrane_potential": membrane_potential_gather,
    "dna_fragmentation_index": dna_fragmentation_index_gather,
}



# =============================================
# 调理建议部分
adjustment_dict_summarizing = {
    "diet_advices": [
        {
            "sentence_structure": [
                "建议多摄入{}、{}等富含DHA的深海鱼类,DHA水平直接影响精子活力与尾部摆动能力,从而影响受精过程",
                "增加DHA摄入可优化精子形态,推荐食用{}、{}等海洋鱼类",
                "建议多食用{}、{}等食物,DHA可提升精卵结合成功率",
                "DHA缺乏会降低精子活力,建议通过{}、{}等深海鱼类补充",
                "补充DHA有助于改善精子活力、外形,每日摄入{}、{}可增强生殖功能",
                "推荐多食用富含DHA的{}、{}等,DHA含量的高低,会影响精子的活力、外形,甚至精子尾巴的灵活度,进而影响精子和卵子的结合",
                "保持精浆DHA浓度可提升精子超激活运动,建议每周均食用深海鱼类例如{}、{}",
                "DHA可以增强精子活力,{}、{}等是优质摄入来源,建议每周摄入一些",
                "精子DNA完整性维护需要充足DHA,建议日常饮食应包含{}、{}等富DHA食物",
                "推荐将{}、{}作为DHA补充源,可有效改善精子活力"
            ],
            "filler": ["沙丁鱼", "三文鱼"],
            "target": ["男性"],
            "condition": "",
            "classify": "diet_advices"
        },
        {
            "sentence_structure": [
                "建议多补充叶酸及锌元素,{}、{}等食物可有效提升精子活力",
                "锌与叶酸协同作用可优化精子质量,推荐食用{}、{}等食物增强生殖功能",
                "每日补充足量叶酸和锌(如{}、{}),可提升精子前向运动比例及DNA完整性",
                "锌元素参与精子形成关键酶活性调节,{}、{}等食物建议每周摄入",
                "叶酸联合锌会提升精子活力,推荐通过{}、{}等食物获取锌元素",
                "精子活力依赖锌含量,{}、{}等食物建议搭配食用",
                "锌缺乏使精子活力降低,建议通过{}、{}等食物补充锌元素",
                "推荐增加锌元素和叶酸的摄入,{}、{}等食物可提升精子活力",
                "精子膜稳定性与锌浓度正相关,{}、{}等富锌食物建议搭配叶酸补充",
                "锌元素和叶酸这两类营养元素有助于提高精子活力,锌含量丰富的食物有:{}、{}等"
            ],
            "filler": ["牡蛎", "牛肉", "生蚝", "猪肝", "核桃", "芝麻"],
            "target": ["男性"],
            "condition": "",
            "classify": "diet_advices"
        },
        {
            "sentence_structure": [
                "多吃蛋白质高的食物有利于提升精子活力,如{}、{}",
                "建议多摄入蛋白质丰富的食物,如{}、{}等均有利于提升精子活力",
                "多吃含高蛋白的食品,有利于提升精子活力,如{}、{}",
                "优质蛋白食物如{}、{}有利于提升精子活力",
                "推荐多摄入{}、{}补充蛋白质有利于提升精子活力",
                "多吃蛋白质丰富的食物有利于提升精子活力,包括{}、{}",
                "蛋白质高的食物如{}、{}有利于提升精子活力",
                "摄入{}、{}等蛋白质食品有利于提升精子活力",
                "多吃富含蛋白质的食品如{}、{},有利于提升精子活力",
                "建议通过{}、{}补充优质蛋白,有利于提升精子活力"
            ],
            "filler": ["牛奶", "黄豆", "鱼", "虾", "蛋类", "牛羊肉", "猪肉"],
            "target": ["男性"],
            "condition": "",
            "classify": "diet_advices"
        },
        {
            "sentence_structure": [
                "多吃蛋白质高的食物有利于卵泡健康发育,如{}、{}",
                "建议多摄入蛋白质丰富的食物,如{}、{},能够增加子宫内膜的厚度,刺激卵泡发育",
                "多吃含高蛋白的食品,促进卵泡发育,如{}、{}",
                "优质蛋白食物如{}、{}有助于卵泡生长",
                "推荐多摄入{}、{}补充蛋白质,能够增加子宫内膜的厚度,刺激卵泡发育",
                "多吃蛋白质丰富的食物能够促进卵泡生长,包括{}、{}",
                "蛋白质高的食物如{}、{}有助于卵泡发育",
                "摄入{}、{}等蛋白质食品,促进卵泡发育",
                "多吃富含蛋白质的食品如{}、{},有助于卵泡健康成长",
                "建议通过{}、{}补充优质蛋白,促进卵泡发育"
            ],
            "filler": ["牛奶", "黄豆", "鱼虾", "蛋类", "牛羊肉", "猪肉"],
            "target": ["女性"],
            "condition": "",
            "classify": "diet_advices"
        },
        {
            "sentence_structure": [
                "多喝{}、{}",
                "建议多饮用{}、{}",
                "推荐常喝{}、{}",
                "多喝温热的{}、{}补充营养",
                "建议饮用热{}、{}",
                "多饮热{}、{}促进健康",
                "{}、{}都是好的饮品选择",
                "多喝{}、{}补充营养",
                "常饮热{}、{}有益健康",
                "建议热饮{}、{}"
            ],
            "filler": ["红糖姜水", "黑豆浆", "蛋白粉"],
            "target": ["女性"],
            "condition": "",
            "classify": "diet_advices"
        },
        {
            "sentence_structure": [
                "摄入富含抗氧化剂食物,{}、{}等",
                "建议多吃含抗氧化物的{}、{}",
                "推荐摄取富含抗氧化成分的{}、{}",
                "多吃{}、{}来补充抗氧化剂",
                "鼓励摄入含有丰富抗氧化剂的{}、{}",
                "摄取多样化的抗氧化食物,如{}、{}",
                "建议增加富含抗氧化物质的{}、{}的摄入",
                "多食用富含抗氧化剂的天然食物,例如{}、{}",
                "保持抗氧化剂摄入充足,多吃{}、{}",
                "推荐日常饮食中加入丰富抗氧化剂的{}、{}"
            ],
            "filler": ["新鲜蔬果", "坚果", "全谷物"],
            "target": [],
            "condition": "",
            "classify": "diet_advices"
        },
        {
            "sentence_structure": [
                "多吃{}、{}等水果",
                "建议多摄入{}、{}等水果",
                "推荐食用{}、{}等富含维生素的水果",
                "多吃富含维生素的水果,如{}、{}",
                "增加{}、{}的水果摄入量",
                "多摄取{}、{}等健康水果",
                "{}、{}是推荐的优质水果",
                "鼓励多食用{}、{}等水果",
                "多吃{}、{},补充营养",
                "建议通过{}、{}摄取多种维生素"
            ],
            "filler": ["猕猴桃", "葡萄", "提子", "香蕉"],
            "target": [],
            "condition": "",
            "classify": "diet_advices"
        },
        {
            "sentence_structure": [
                "保持营养均衡",
                "建议维持营养摄入的均衡与多样化",
                "保持膳食营养的均衡和全面",
                "推荐均衡摄入各种营养素以维持健康",
                "饮食要注重营养均衡,保证身体所需",
                "提倡均衡饮食,确保营养全面摄取",
                "建议合理搭配食物,保持营养均衡",
                "保持饮食结构的均衡,摄入多种营养素",
                "维持均衡膳食,促进身体健康",
                "强调营养均衡,避免偏食和单一饮食"
            ],
            "filler": [],
            "target": [],
            "condition": "",
            "classify": "diet_advices"
        },
        {
            "sentence_structure": [
                "减少高糖、高脂食品",
                "建议少吃含糖量高和脂肪含量高的食物",
                "减少摄入糖分和脂肪含量较高的食品",
                "控制高糖和高脂食物的摄入量",
                "避免过多食用含糖和油脂丰富的食品",
                "建议限制高糖高脂食品的摄入",
                "少吃甜食和高脂肪的食物有助于健康",
                "减少食用糖分和脂肪含量较多的食品",
                "降低高糖、高脂食品的摄入频率",
                "尽量避免摄入过多的高糖高脂食物"
            ],
            "filler": [],
            "target": [],
            "condition": "",
            "classify": "diet_advices"
        },
        {
            "sentence_structure": [
                "忌烟、酒、咖啡和茶等刺激性饮品",
                "建议避免吸烟、饮酒及饮用咖啡和茶等刺激性饮料",
                "戒烟戒酒,少喝咖啡和茶等刺激性饮品",
                "避免烟酒和含咖啡因或茶碱的饮料摄入",
                "忌用烟草、酒精及刺激性饮品如咖啡和茶",
                "减少吸烟、饮酒和饮用刺激性饮料的习惯",
                "避免吸烟、饮酒和咖啡、茶等刺激饮品",
                "戒除烟酒及减少咖啡、茶的摄入量",
                "尽量远离烟草、酒精和刺激性饮品",
                "建议不吸烟、不饮酒,少喝咖啡和茶"
            ],
            "filler": [],
            "target": [],
            "condition": "",
            "classify": "diet_advices"
        },
    ],
    "workout_advices": [
        {
            "sentence_structure": [
                "保持适度运动,如{}、{}等,出汗为佳,助孕改善血液循环和内分泌",
                "建议进行适量运动,比如{}、{},出汗效果最好,有助于提升血液循环及内分泌功能",
                "适度锻炼如{}、{},出汗为理想状态,能促进血液循环和内分泌系统健康,助力怀孕",
                "通过{}、{}等适度运动改善身体循环和激素平衡",
                "推荐适量运动,如{}、{},最好达到出汗效果,帮助优化血液和内分泌状态",
                "适度进行{}、{}等运动,最好达到出汗效果,有助于增强血液流动和内分泌调节",
                "坚持{}、{}等适当运动,最好达到出汗效果,有利于改善血液循环与内分泌系统",
                "适量做{}、{},达到适度出汗效果,促进血液循环及内分泌平衡,有助孕育健康",
                "通过{}、{}等适度运动增强循环系统和内分泌功能",
                "保持适当的{}、{}锻炼,达到适度出汗效果,有助于改善血液循环与激素水平"
            ],
            "filler": ["瑜伽", "散步", "跳操"],
            "target": ["女性"],
            "condition": "",
            "classify": "workout_advices"
        },
        {
            "sentence_structure": [
                "保持适度运动,如{}、{}等,助孕改善血液循环和内分泌",
                "建议进行适量运动,比如{}、{},有助于提升血液循环及内分泌功能",
                "适度锻炼如{}、{}能促进血液循环和内分泌系统健康",
                "通过{}、{}等适度运动改善身体循环和激素平衡",
                "推荐适量运动,如{}、{},帮助优化血液和内分泌状态",
                "适度进行{}、{}等运动,有助于增强血液流动和内分泌调节",
                "坚持{}、{}等适当运动,有利于改善血液循环与内分泌系统",
                "适量{}、{},促进血液循环及内分泌平衡,有助健康",
                "通过{}、{}等适度运动增强循环系统和内分泌功能",
                "保持适当的{}、{}锻炼,有助于改善血液循环与激素水平"
            ],
            "filler": ["散步", "健走", "跳绳"],
            "target": ["男性"],
            "condition": "",
            "classify": "workout_advices"
        },
    ],
    "life_advices": [
        {
            "sentence_structure": [
                "每天晚上睡前用温热水泡脚",
                "建议每晚睡觉前用温水泡脚促进血液循环",
                "睡前用温热水泡脚,有助放松和改善睡眠",
                "每天晚上用温水泡脚,帮助身体放松和促进睡眠",
                "睡觉前用温热水浸泡双脚,有利于健康和睡眠质量",
                "坚持每晚用温热水泡脚,改善末梢循环和舒缓疲劳",
                "睡前用温水泡脚,有助于缓解疲劳和促进血液流动",
                "建议晚上睡前泡温热水脚,放松身体提升睡眠",
                "每晚临睡用温水泡脚,有助于放松和身体健康",
                "坚持睡前用温热水泡脚,促进血液循环和休息"
            ],
            "filler": [],
            "target": [],
            "condition": "",
            "classify": "life_advices"
        },
        {
            "sentence_structure": [
                "坚持早睡不熬夜,每天保持充足睡眠7-8小时",
                "建议养成早睡习惯,保证每天7-8小时的充足睡眠",
                "坚持早睡避免熬夜,每晚睡眠时间保持7-8小时",
                "保持规律作息,确保每天有7到8小时的优质睡眠",
                "养成早睡习惯,不熬夜,保证7-8小时的睡眠时间",
                "坚持早睡,避免晚睡熬夜,保证充足的7-8小时睡眠",
                "保持良好睡眠规律,确保每晚7-8小时睡眠时间",
                "早睡不熬夜,保证充足睡眠7-8小时,有利健康",
                "建议每天早睡,避免熬夜,确保7-8小时充足睡眠",
                "保持充足睡眠时间,养成早睡不熬夜的好习惯"
            ],
            "filler": [],
            "target": [],
            "condition": "",
            "classify": "life_advices"
        },
    ],
    "hcp_advices": [
        {
            "sentence_structure": [
                "建议坚持服用女版助孕宝和其他保健品维生素调理身体,改善卵巢功能,提高卵泡质量",
                "推荐持续服用女性助孕宝及相关维生素,帮助调理身体和提升卵巢健康",
                "坚持服用女版助孕宝配合维生素,有助改善卵巢功能和卵泡品质",
                "建议长期服用女性专用助孕宝及营养补充剂,促进卵泡质量提升",
                "服用女版助孕宝和维生素保健品,调理体质,提高卵巢和卵泡状态",
                "建议使用女性助孕宝配合维生素调养,增强卵巢功能和卵泡发育",
                "持续服用女性助孕宝及保健维生素,有利于改善卵泡质量和卵巢功能",
                "坚持补充女版助孕宝及维生素,有助于卵巢调理和卵泡健康",
                "服用女版助孕宝与维生素保健品,促进卵巢健康和卵泡生长",
                "建议持续使用女性助孕宝结合维生素调理,改善卵巢功能,提高卵泡质量"
            ],
            "filler": [],
            "target": ["女性"],
            "condition": "",
            "classify": "hcp_advices"
        },
        {
            "sentence_structure": [
                "辅酶COQ 10 (200mg)：早、中、晚, 各吃 1粒(如果服用助孕宝就不用加服)",
                "每天早、中、晚各服用1粒200mg辅酶Q10(服用助孕宝者可不额外补充)",
                "辅酶Q10 200mg,建议早、中、晚各1粒,如已服助孕宝则无需额外服用",
                "建议每日三次服用辅酶Q10(200mg),如已服用助孕宝可省略此项",
                "服用辅酶Q10(200mg)每天三次,早、中、晚各1粒,服用助孕宝者可不加服",
                "辅酶Q10 200mg建议早、中、晚服用各1粒,服助孕宝者无须重复补充",
                "每日早、中、晚各服1粒200mg辅酶Q10,如服用助孕宝则不需再服用",
                "服用辅酶Q10,每日三次,每次200mg,服用助孕宝时可不加用",
                "建议早、中、晚各服用辅酶Q10 200mg,如已使用助孕宝则可免服",
                "辅酶Q10(200mg)建议早中晚三次服用,若服助孕宝则无需加服"
            ],
            "filler": [],
            "target": ["女性"],
            "condition": "",
            "classify": "hcp_advices"
        },
        {
            "sentence_structure": [
                "无用药禁忌条件下可以服用DHEA 50mg/天,调理身体一个月",
                "如无禁忌,建议女性35岁以上每日服用DHEA 50mg,持续一个月",
                "无药物禁忌时可服用DHEA 50mg/天,调理身体时间为一个月",
                "适合35岁以上女性,条件允许时每天服用50mg DHEA,调理身体一个月",
                "在无禁忌条件下,建议每日服用50mg DHEA,调理身体周期为一个月",
                "无用药冲突时,35岁以上女性可服用DHEA 50mg/天,调理一个月",
                "建议无禁忌者服用DHEA 50mg每天,调理身体持续一个月",
                "条件允许下,35岁以上女性每日服用50mg DHEA,调理一个月",
                "无禁忌的情况下,建议服用DHEA 50mg/天,调理身体时间为一个月",
                "适用于无禁忌条件的35岁以上女性,每日服用50mg DHEA调理一个月"
            ],
            "filler": [],
            "target": ["女性","大于35岁"],
            "condition": "",
            "classify": "hcp_advices"
        },
        {
            "sentence_structure": [
                "服用男版助孕宝 每日早1粒,晚1粒",
                "建议男性每日早晚各服用一粒男版助孕宝",
                "男性每日两次服用男版助孕宝,早晚各一粒",
                "每日早晚服用男版助孕宝各1粒,助力男性健康",
                "男性建议每天早晚各服用一粒男版助孕宝",
                "坚持每日早晚服用男版助孕宝,每次一粒",
                "男性服用男版助孕宝,早晚各1粒为宜",
                "男士每日早晚各服用一粒男版助孕宝,调理身体",
                "建议男性每天早晚服用男版助孕宝一粒",
                "每天早上和晚上服用男版助孕宝各1粒,适合男性"
            ],
            "filler": [],
            "target": ["男性"],
            "condition": "",
            "classify": "hcp_advices"
        },
        {
            "sentence_structure": [
                "辅酶COQ 10 (200mg)：早、中、晚, 各吃 1粒(如果服用助孕宝就不用加服)",
                "男性建议早、中、晚各服用一粒200mg辅酶Q10,服用助孕宝则无需额外补充",
                "辅酶Q10 200mg,每天三次服用,每次1粒,若已服助孕宝可免服",
                "建议男性每天早中晚服用辅酶Q10(200mg)各1粒,服用助孕宝可不加服",
                "辅酶Q10 200mg建议男性早、中、晚各1粒服用,如服助孕宝则无需重复",
                "男性每日三次服用辅酶Q10 200mg,早、中、晚各1粒,助孕宝服用者可免",
                "辅酶Q10(200mg)建议男性早晚及中午各服一粒,服用助孕宝可不需额外服用",
                "建议男性每日早、中、晚各服1粒辅酶Q10(200mg),已服助孕宝可省",
                "男性每日服用辅酶Q10三次,200mg每次,助孕宝用户可不加服",
                "辅酶Q10 200mg每日三次服用,早、中、晚各一粒,服助孕宝者可免"
            ],
            "filler": [],
            "target": ["男性"],
            "condition": "",
            "classify": "hcp_advices"
        },
        {
            "sentence_structure": [
                "服用维生素VIT d3 ,0.05mg/天",
                "建议每日补充维生素D3,剂量为0.05mg",
                "每天服用0.05mg维生素D3以维持健康水平",
                "推荐每日摄入0.05mg维生素D3",
                "建议每日补充0.05mg维生素D3,促进骨骼和免疫健康",
                "服用维生素D3 0.05mg每天,支持身体多项功能",
                "每日服用维生素D3 0.05mg,有助于免疫调节和骨骼健康",
                "维生素D3建议每日摄入0.05mg,维持身体健康",
                "每天补充0.05mg的维生素D3,有益健康",
                "推荐每日服用维生素D3 0.05mg,保持营养均衡"
            ],
            "filler": [],
            "target": [],
            "condition": "",
            "classify": "hcp_advices"
        },
    ],
    "targeted_advices": [
        {
            "sentence_structure": [
                "DHEA提升至100mg/天",
                "建议将DHEA剂量提高到每天100毫克",
                "每日服用DHEA调整为100mg",
                "推荐把DHEA用量增加至100mg每天",
                "服用DHEA的剂量调整为每日100毫克",
                "建议将DHEA每日摄入量提高至100mg",
                "DHEA用量建议提升至100mg每天",
                "调整DHEA剂量至每日100mg以改善状况",
                "建议每日服用100毫克DHEA",
                "DHEA剂量建议增加到100mg每天"
            ],
            "filler": [],
            "target": [],
            "condition": "抗缪勒管激素(AMH)过低", 
            "classify": "targeted_advices"
        },
        {
            "sentence_structure": [
                "去掉DHEA",
                "建议停止服用DHEA",
                "不建议继续使用DHEA",
                "应当停用DHEA",
                "建议取消DHEA的服用",
                "停止服用DHEA为宜",
                "建议中止DHEA用药",
                "不再服用DHEA",
                "应停止每日DHEA摄入",
                "建议去除DHEA治疗"
            ],
            "filler": [],
            "target": [],
            "condition": "睾酮(Testosterone)过高",
            "classify": "targeted_advices"
        },
        {
            "sentence_structure": [
                "为了提高试管成功率,建议服用男性助孕宝提高精子质量",
                "建议男性服用助孕宝以提升精子质量,增加试管成功几率",
                "服用男性助孕宝有助于改善精子质量,提高体外受精成功率",
                "为了增强试管婴儿成功率,推荐男性服用助孕宝改善精子",
                "男性服用助孕宝可以提升精子品质,从而提高试管成功率",
                "为了优化试管受精效果,建议男性服用助孕宝提高精子质量",
                "助孕宝服用有助于提升男性精子质量,促进试管成功",
                "建议男性通过助孕宝改善精子,助力试管婴儿成功率",
                "服用男性助孕宝可有效提升精子质量,增加试管受孕率",
                "提升试管成功率建议男性服用助孕宝改善精子健康"
            ],
            "filler": [],
            "target": ["男性"],
            "condition": "DNA碎片化指数过高",
            "classify": "targeted_advices"
        },
        {
            "sentence_structure": [
                "可能会有一点影响受精率和养囊,这种情况可能会导致受精后期的胚胎发育潜能下降。实验室会优选外形最优秀的精子去和卵子受精",
                "精子异常可能轻微影响受精和囊胚培养,导致胚胎后期发育能力降低。实验室会选取形态最佳的精子进行受精",
                "此类精子指标异常可能降低受精率和养囊成功率,胚胎发育潜能受到影响。实验室优先选择形态优良的精子进行体外受精",
                "异常精子可能影响受精及囊胚发育,导致胚胎发育潜力下降。实验室会筛选最佳形态的精子进行授精",
                "精子其他异常指标可能对受精率和胚胎发育产生一定影响,实验室将选用形态最优精子授精",
                "这类异常会影响受精及养囊效率,胚胎后期发育潜力可能受限。实验室优选形态良好的精子受精",
                "精子异常可能导致受精率和囊胚培养效果下降,胚胎发育潜能减少。实验室会选择外形优秀的精子与卵子结合",
                "可能会轻微影响胚胎受精和养囊,降低胚胎发育潜能。实验室筛选最佳精子形态进行受精操作",
                "这类精子异常情况可能降低受精和养囊成功率,胚胎发育潜力下降。实验室优先选用形态佳的精子授精",
                "精子其他指标异常可能影响受精及囊胚发育,导致胚胎发育能力下降。实验室会选择形态良好精子完成受精"
            ],
            "filler": [],
            "target": ["精子其他指标异常", "男性"],
            "condition": "",
            "classify": "targeted_advices"
        },
            {
                "sentence_structure": [
                    "建议补充富含雌激素的食物,可多食用{}、{}",
                    "推荐摄入与雌激素相关的食物,包括{}、{}",
                    "建议多吃有助于补充雌激素的食物,例如{}、{}",
                    "推荐补充含雌激素的相关食物,可多吃{}、{}",
                    "建议通过食用{}、{}等食物来补充雌激素",
                    "推荐摄入{}、{}等与雌激素相关的食物",
                    "建议多食用{}、{}等,以补充雌激素相关营养",
                    "推荐补充雌激素相关食物,可多吃{}、{}",
                    "建议在饮食中加入{}、{}等,以补充雌激素相关营养",
                    "推荐食用{}、{},来补充雌激素相关食物"
                ],
                "filler": ["蜂蜜", "蜂王浆(需注意控制量,防止激素摄入过量)"],
                "target": ["女性"],
                "condition": "子宫内膜厚度过小",
                "classify": "targeted_advices"
            },
            {
                "sentence_structure": [
                    "建议规避高雌激素饮食：减少{}、{}等富含雌激素保健品的食用量",
                    "推荐避免高雌激素饮食结构：降低{}、{}等含雌激素保健品的摄入量",
                    "需避免高雌激素饮食：减少{}、{}等雌激素类保健品的摄入",
                    "建议对高雌激素饮食进行控制：减少{}、{}等含雌激素保健品的食用",
                    "推荐规避含高雌激素的饮食：降低{}、{}等保健品的摄入量",
                    "需避免摄入高雌激素饮食：减少{}、{}等富含雌激素的保健品",
                    "建议控制高雌激素饮食摄入：减少{}、{}等含雌激素保健品的食用量",
                    "推荐避免高雌激素饮食模式：降低{}、{}等雌激素类保健品的摄入",
                    "需对高雌激素饮食进行限制：减少{}、{}等含雌激素保健品的食用",
                    "建议减少高雌激素饮食摄入：降低{}、{}等保健品的食用量"
                ],
                "filler": ["蜂王浆", "胎盘制品", "雪蛤"],
                "target": ["女性"],
                "condition": "子宫内膜厚度过大",
                "classify": "targeted_advices"
            },
            {
                "sentence_structure": [
                    "同时控制{}、{}摄入,防止肥胖加重内分泌紊乱",
                    "同时限制{}、{},避免因肥胖导致内分泌失调加剧",
                    "同时控制{}、{},防止肥胖进一步引发内分泌紊乱",
                    "同时限制{}、{},避免肥胖导致内分泌失衡加重",
                    "同时控制{}、{},防止肥胖加剧内分泌系统紊乱",
                    "同时限制{}、{},避免肥胖导致内分泌紊乱恶化",
                    "同时节制{}、{},防止肥胖加重内分泌失调",
                    "同时控制{}、{},避免肥胖引发内分泌紊乱加剧",
                    "同时限制{}、{},防止肥胖导致内分泌系统失衡加重",
                    "同时控制{}、{},避免肥胖加剧内分泌紊乱问题"
                ],
                "filler": [ "油炸食品", "甜食"],
                "target": ["女性"],
                "condition": "子宫内膜厚度过大",
                "classify": "targeted_advices"
            },
            {
                "sentence_structure": [
                    "建议适当补充维生素D(可通过食用深海鱼或适度日晒),研究表明这可能有助于改善PCOS患者的排卵功能",
                    "推荐通过摄入深海鱼或适度日晒来补充维生素D,相关研究显示其可能对PCOS患者的排卵功能有改善作用",
                    "建议适当补充维生素D(如食用深海鱼或接受阳光照射),研究发现其或许能改善PCOS患者的排卵功能",
                    "推荐通过食用深海鱼或合理日晒来补充维生素D,有研究显示这可能对PCOS患者的排卵功能产生改善效果",
                    "建议适当补充维生素D(例如深海鱼摄入或日晒),研究表明其可能对PCOS患者的排卵功能起到改善作用",
                    "推荐借助深海鱼食用或适度日晒来补充维生素D,相关研究显示这或许能改善PCOS患者的排卵功能",
                    "建议适当补充维生素D(如深海鱼、日晒等方式),研究发现其可能有助于提升PCOS患者的排卵功能",
                    "推荐通过深海鱼摄入或合理日晒补充维生素D,研究显示这可能对改善PCOS患者的排卵功能有益",
                    "建议适当补充维生素D(可从深海鱼获取或通过日晒),研究表明其可能对PCOS患者的排卵功能改善有帮助",
                    "推荐借助食用深海鱼或适度日晒来补充维生素D,有研究显示这或许能改善PCOS患者的排卵功能"
                ],
                "filler": [],
                "target": ["女性"],
                "condition": "卵泡尺寸偏大",
                "classify": "targeted_advices"
            },
            {
                "sentence_structure": [
                    "建议肥胖人群采用低热量饮食搭配每周5次、每次30分钟的有氧运动来减重,从而降低胰岛素抵抗和雌激素水平,建议消瘦者注重均衡营养摄入,避免因过度节食对内分泌系统造成不良影响",
                    "推荐肥胖者通过低热量饮食结合每周5次、每次30分钟的有氧锻炼减轻体重,以改善胰岛素抵抗并降低雌激素水平,推荐消瘦人群保持膳食营养均衡,防止过度节食干扰内分泌功能的正常运行",
                    "肥胖者可借助低热量饮食与每周5次、每次30分钟的有氧运动实现减重,进而降低胰岛素抵抗和体内雌激素水平,消瘦者需均衡摄取各类营养,避免通过过度节食的方式控制体重,以防影响内分泌平衡",
                    "建议肥胖人群以低热量饮食为基础,配合每周5次、每次30分钟的有氧运动减重,以此改善胰岛素抵抗并调节雌激素水平,建议消瘦人群保证营养均衡,杜绝过度节食行为,避免内分泌系统受到不良影响",
                    "推荐肥胖者采用低热量膳食结构搭配每周5次、每次30分钟的有氧训练(如慢跑、游泳),通过减重降低胰岛素抵抗和雌激素水平,推荐消瘦者维持均衡的营养摄入,避免采用过度节食的方式,防止对内分泌产生干扰",
                    "肥胖者可通过控制低热量饮食并进行每周5次、每次30分钟的有氧运动减轻体重,从而降低胰岛素抵抗及雌激素水平,消瘦者应注重营养均衡,避免过度节食减肥,以防影响内分泌系统的正常调节",
                    "建议肥胖人群选择低热量饮食结合每周5次、每次30分钟的有氧锻炼(如快走、跳绳),以减重为目标降低胰岛素抵抗和雌激素水平,建议消瘦人群均衡饮食营养,避免因过度节食导致内分泌失调",
                    "推荐肥胖者通过低热量饮食与每周5次、每次30分钟的有氧运动(如骑自行车、健身操)减重,进而改善胰岛素抵抗并下调雌激素水平,推荐消瘦者保证营养均衡,避免过度节食,防止内分泌功能受到影响",
                    "肥胖者可借助低热量饮食搭配每周5次、每次30分钟的有氧训练实现体重管理,以此降低胰岛素抵抗和血液中的雌激素水平,消瘦者需均衡摄取营养,避免过度节食,以免对内分泌产生不良影响",
                    "建议肥胖人群以低热量饮食为核心,配合每周5次、每次30分钟的有氧运动(如爬楼梯、舞蹈)减重,从而改善胰岛素抵抗并平衡雌激素水平,建议消瘦人群注重营养均衡,杜绝过度节食,防止内分泌系统受干扰"
                ],
                "filler": [],
                "target": ["女性"],
                "condition": "卵泡尺寸偏大",
                "classify": "targeted_advices"
            },
            {
                "sentence_structure": [
                    "建议适当补充维生素D(可通过食用深海鱼或适度日晒),研究表明这可能有助于改善PCOS患者的排卵功能",
                    "推荐通过摄入深海鱼或适度日晒来补充维生素D,相关研究显示其可能对PCOS患者的排卵功能有改善作用",
                    "建议适当补充维生素D(如食用深海鱼或接受阳光照射),研究发现其或许能改善PCOS患者的排卵功能",
                    "推荐通过食用深海鱼或合理日晒来补充维生素D,有研究显示这可能对PCOS患者的排卵功能产生改善效果",
                    "建议适当补充维生素D(例如深海鱼摄入或日晒),研究表明其可能对PCOS患者的排卵功能起到改善作用",
                    "推荐借助深海鱼食用或适度日晒来补充维生素D,相关研究显示这或许能改善PCOS患者的排卵功能",
                    "建议适当补充维生素D(如深海鱼、日晒等方式),研究发现其可能有助于提升PCOS患者的排卵功能",
                    "推荐通过深海鱼摄入或合理日晒补充维生素D,研究显示这可能对改善PCOS患者的排卵功能有益",
                    "建议适当补充维生素D(可从深海鱼获取或通过日晒),研究表明其可能对PCOS患者的排卵功能改善有帮助",
                    "推荐借助食用深海鱼或适度日晒来补充维生素D,有研究显示这或许能改善PCOS患者的排卵功能"
                ],
                "filler": [],
                "target": ["女性"],
                "condition": "卵泡尺寸过大",
                "classify": "targeted_advices"
            },
            {
                "sentence_structure": [
                    "建议肥胖人群采用低热量饮食搭配每周5次、每次30分钟的有氧运动来减重,从而降低胰岛素抵抗和雌激素水平,建议消瘦者注重均衡营养摄入,避免因过度节食对内分泌系统造成不良影响",
                    "推荐肥胖者通过低热量饮食结合每周5次、每次30分钟的有氧锻炼减轻体重,以改善胰岛素抵抗并降低雌激素水平,推荐消瘦人群保持膳食营养均衡,防止过度节食干扰内分泌功能的正常运行",
                    "肥胖者可借助低热量饮食与每周5次、每次30分钟的有氧运动实现减重,进而降低胰岛素抵抗和体内雌激素水平,消瘦者需均衡摄取各类营养,避免通过过度节食的方式控制体重,以防影响内分泌平衡",
                    "建议肥胖人群以低热量饮食为基础,配合每周5次、每次30分钟的有氧运动减重,以此改善胰岛素抵抗并调节雌激素水平,建议消瘦人群保证营养均衡,杜绝过度节食行为,避免内分泌系统受到不良影响",
                    "推荐肥胖者采用低热量膳食结构搭配每周5次、每次30分钟的有氧训练(如慢跑、游泳),通过减重降低胰岛素抵抗和雌激素水平,推荐消瘦者维持均衡的营养摄入,避免采用过度节食的方式,防止对内分泌产生干扰",
                    "肥胖者可通过控制低热量饮食并进行每周5次、每次30分钟的有氧运动减轻体重,从而降低胰岛素抵抗及雌激素水平,消瘦者应注重营养均衡,避免过度节食减肥,以防影响内分泌系统的正常调节",
                    "建议肥胖人群选择低热量饮食结合每周5次、每次30分钟的有氧锻炼(如快走、跳绳),以减重为目标降低胰岛素抵抗和雌激素水平,建议消瘦人群均衡饮食营养,避免因过度节食导致内分泌失调",
                    "推荐肥胖者通过低热量饮食与每周5次、每次30分钟的有氧运动(如骑自行车、健身操)减重,进而改善胰岛素抵抗并下调雌激素水平,推荐消瘦者保证营养均衡,避免过度节食,防止内分泌功能受到影响",
                    "肥胖者可借助低热量饮食搭配每周5次、每次30分钟的有氧训练实现体重管理,以此降低胰岛素抵抗和血液中的雌激素水平,消瘦者需均衡摄取营养,避免过度节食,以免对内分泌产生不良影响",
                    "建议肥胖人群以低热量饮食为核心,配合每周5次、每次30分钟的有氧运动(如爬楼梯、舞蹈)减重,从而改善胰岛素抵抗并平衡雌激素水平,建议消瘦人群注重营养均衡,杜绝过度节食,防止内分泌系统受干扰"
                ],
                "filler": [],
                "target": ["女性"],
                "condition": "卵泡尺寸过大",
                "classify": "targeted_advices"
            }
    ]
}


# try_str = "10⁰ ¹ ² ³ ⁴ ⁵ ⁶ ⁷ ⁸ ⁹ ⁶ ⁹"
